[["Absolute magnitude", "Absolute magnitudeis a measure of a star's absolute brightness. It is defined as the apparent magnitude the star would show if it were located at a distance of 10&#160;parsecs, or 32.6&#160;light years.", "https://en.wikipedia.org/wiki/Absolute_magnitude"], ["Accretion disk", "Accretion diskis a roughly circular mass of diffuse material in orbit around a central object, such as a star or black hole. The material has been acquired from a source external to the central object.", "https://en.wikipedia.org/wiki/Accretion_disk"], ["Active galactic nucleus", "Active galactic nucleusis a compact region in the middle of a galaxy displaying a higher than normal luminosity over some part of theelectromagnetic spectrum.", "https://en.wikipedia.org/wiki/Active_galactic_nucleus"], ["Albedo feature", "Albedo featureis a large area on the surface of a reflecting object that shows a contrast in brightness or darkness (albedo) with adjacent areas.", "https://en.wikipedia.org/wiki/Albedo_feature"], ["Am star", "Am staris achemically peculiar starbelonging to the more general class ofA-type stars. The spectrum of the Am stars shows abnormal enhancements and deficiencies of certain metals. (Seemetallicitybelow.)", "https://en.wikipedia.org/wiki/Am_star"], ["Aphelion", "Aphelionis the point in the orbit of a planet, asteroid, or comet at which it is furthest from the sun.", "https://en.wikipedia.org/wiki/Perihelion_and_aphelion"], ["Apoapsis", "Apoapsisis the point of furthest excursion, or separation, between two orbiting objects.", "https://en.wikipedia.org/wiki/Apoapsis"], ["Apparent magnitude", "Apparent magnitudeis a measure of the brightness of a celestial body as seen by an observer on Earth, adjusted to the value it would have in the absence of theatmosphere. The brighter the object appears, the lower the value of its magnitude.", "https://en.wikipedia.org/wiki/Apparent_magnitude"], ["Appulse", "Appulseis the closest approach of one celestial object to another, as viewed from a third body.", "https://en.wikipedia.org/wiki/Appulse"], ["Asterism", "Asterismis a pattern of stars recognized on Earth's night sky. It may form part of an official constellation, or be composed of stars from more than one.", "https://en.wikipedia.org/wiki/Asterism_(astronomy)"], ["Astrometric binary", "Astrometric binaryis a type of binary system where evidence for an unseen orbiting companion is revealed by its periodicgravitational perturbationof the visible component. See alsospectroscopic binary.", "https://en.wikipedia.org/wiki/Astrometric_binary"], ["Astronomical unit", "Astronomical unit, or AU, is the approximate distance between the midpoints of the Earth and the Sun.", "https://en.wikipedia.org/wiki/Astronomical_unit"], ["Autumnal equinox", "Autumnal equinoxis the point in the year when the Sun appears to cross thecelestial equator, while generally trending southward at each zenith passage. It represents the moment when theNorth Poleof the Earth begins to tilt away from the Sun.", "https://en.wikipedia.org/wiki/Autumnal_equinox"], ["Azimuth", "Azimuthis an angular measurement of an object's orientation along the horizon of the observer, relative to the direction oftrue north. When combined with thealtitudeabove the horizon, it defines an object's current position in thespherical coordinate system.", "https://en.wikipedia.org/wiki/Azimuth"], ["Baryogenesis", "Baryogenesisis the process by which the class ofsubatomic particlescalledbaryonswere generated in the early Universe, including the means by which baryons outnumber antibaryons.", "https://en.wikipedia.org/wiki/Baryogenesis"], ["Big Bang", "Big Bangis the prevailingcosmological modelfor the origin of theobservable Universe. It depicts a starting condition of extremely high density and temperature, followed by an ongoing expansion that led to the current conditions.", "https://en.wikipedia.org/wiki/Big_Bang"], ["Black hole", "Black holeis a concentration of mass so compact that it creates a region of space from which not even light can escape. The outer boundary of this region is called theevent horizon.", "https://en.wikipedia.org/wiki/Black_hole"], ["centrifugal force", "Break-up velocity,critical velocity, orcritical rotationof a rapidly spinning star is the surface velocity at which thecentrifugal forcejust matches the force ofNewtonian gravity. Beyond this point, the star would begin to eject matter from its surface.&#91;1&#93;", "https://en.wikipedia.org/wiki/Centrifugal_force"], ["Brown dwarf", "Brown dwarfis asubstellar objectthat is too low in mass to sustain thenuclear fusionofhydrogen-1in its core, with the latter being a characteristic of stars on themain sequence. Brown dwarfs can still generate energy fromgravitational contractionand by the fusion ofdeuterium.", "https://en.wikipedia.org/wiki/Brown_dwarf"], ["Celestial sphere", "Celestial sphereis an imaginary sphere that covers the entire sky and is stationary with respect to the background stars. It is used as a tool forspherical astronomy.", "https://en.wikipedia.org/wiki/Celestial_sphere"], ["magnetic activity", "Chromospheric activity indexis a parameter indicating themagnetic activityin a star'schromosphere. One measure of this activity islogRHK, whereRHKis the ratio of theequivalent widthof a star'ssingly-ionizedCalciumH and K lines, after correction forphotosphericlight, to thebolometricflux.&#91;2&#93;", "https://en.wikipedia.org/wiki/Stellar_magnetic_field"], ["Color index", "Color indexis a numeric value that is used to compare the brightness of a star measured from differentfrequencybands of theelectromagnetic spectrum. Because the energy output of a star varies by frequency as a function of temperature, the color index can be used to indicate the star's temperature.", "https://en.wikipedia.org/wiki/Color_index"], ["Comets", "Cometsare relatively small, icy bodies that display extended features when they approach the Sun. The energy from the Sun vaporizesvolatileson a comet's surface, producing a visiblecomaaround the cometary body. Sometimes a comet can produce a longtailradiating away from the Sun.", "https://en.wikipedia.org/wiki/Comet"], ["Commensurability", "Commensurabilityis the property of two objectsorbitingthe same body whoseperiodsare in arationalproportion. For example, the orbital period ofSaturnaround the Sun is very nearly 5/2 the orbital period ofJupiter.", "https://en.wikipedia.org/wiki/Commensurability_(astronomy)"], ["margin of observational error", "Common proper motionis used to indicate two or more stars that share the same motion through space, within themargin of observational error. That is, either they have nearly the sameproper motionandradial velocityparameters, which may suggest that they aregravitationally boundor share a common origin,&#91;3&#93;or they are known to be gravitationally bound (in which case their proper motions may be rather different but average out the same over time).", "https://en.wikipedia.org/wiki/Margin_of_error"], ["Constellation", "Constellationis a region on the celestial sphere surrounding a grouping of stars. The names of constellations are assigned by tradition and often have an associatedfolklorebased inmythology, while the modern demarcation of their borders are established by theInternational Astronomical Unionin 1930.", "https://en.wikipedia.org/wiki/Constellation"], ["corona", "Thecoronais an aura ofplasmathat surrounds cooler stars such as the Sun. It can be observed during asolar eclipseas a bright glow surrounding the disk. The temperature of the corona is much higher than the stellar surface, and the mechanism that creates this heat remains subject to debate among astronomer.", "https://en.wikipedia.org/wiki/Corona"], ["centrifugal force", "Critical rotationis the velocity at the equator of a rotating body where thecentrifugal forcejust balances theNewtonian gravity. At this rotation rate, mass can be readily lost from the equator, forming acircumstellar disk.&#91;4&#93;", "https://en.wikipedia.org/wiki/Centrifugal_force"], ["Declination", "Declination, in theequatorial coordinate system, is the celestial equivalent of terrestriallatitude. Coordinates north of thecelestial equatorare measured in positive degrees from 0 to 90, while coordinates to the south use coordinates in negative degrees.", "https://en.wikipedia.org/wiki/Declination"], ["Be stars", "Decretion diskis a circumstellar disk formed from gas ejected from the central star that now follows a near Keplerian orbit around it. This type of disk can be found around manyBe stars.&#91;5&#93;", "https://en.wikipedia.org/wiki/Be_star"], ["Debris disk", "Debris diskis a ring-shaped circumstellar disk of dust and debris orbiting its host star. It is created by collisions betweenplanetesimals. A debris disk can be discerned from aninfrared excessbeing emitted from the star system, as the orbiting debris re-radiates the star's energy into space as heat.", "https://en.wikipedia.org/wiki/Debris_disk"], ["Double star", "Double staris a pair of stars that appear near each other on the celestial sphere. This can happen because, by chance, the pair lie along nearly the same line of sight from the Earth. If the two are located in physical proximity to each other, they may form a co-moving pair or a binary star system.", "https://en.wikipedia.org/wiki/Double_star"], ["Dwarf star", "Dwarf staris the category of ordinarymain sequencestars like the Sun, in contrast toevolvedgiant starslikeBetelgeuseandAntares. Confusingly, the termdwarfhas also came to includestellar remnantsknown aswhite dwarfsplus low mass, sub-stellar objects calledbrown dwarfs.", "https://en.wikipedia.org/wiki/Dwarf_star"], ["Early-type star", "Early-type staris a hotter and more massive star, in contrast tolate-type starsthat are cooler and less massive. The term originated from historical stellar models that assumed stars began their early life at a high temperature then gradually cooled off as they aged. It can be used to refer to the higher temperature members of any particular population or category of stars, rather than just all stars in general.", "https://en.wikipedia.org/wiki/Early-type_star"], ["Eccentricity", "Eccentricityis a parameter that determines how much an orbit deviates from a perfect circle. For an elliptical orbit, the eccentricity ranges from greater than zero to less than one.", "https://en.wikipedia.org/wiki/Orbital_eccentricity"], ["Ecliptic plane", "Ecliptic plane, or plane of the ecliptic, is the plane defined by the Earth's orbit around the Sun. Hence, the position of the Sun as viewed from Earth defines the intersection of this plane with the celestial sphere. The ecliptic plane is used as a reference plane for describing the position of other Solar System bodies. It differs from thecelestial equatorbecause of theaxial tiltof the Earth.", "https://en.wikipedia.org/wiki/Ecliptic_plane"], ["Effective temperature", "Effective temperatureof a star or planet is the temperature of an idealblack bodythat would emit the same total amount ofelectromagnetic radiation.", "https://en.wikipedia.org/wiki/Effective_temperature"], ["Ephemeris", "Ephemerisis a list or table of the expected positions ofastronomical objectsorartificial satellitesin the sky at various dates and times. Modern ephemerides are often provided by computer software.", "https://en.wikipedia.org/wiki/Ephemeris"], ["Evolutionary track", "Evolutionary trackis a curve on theHertzsprungRussell diagramthat a solitary star, of a particular mass and composition, is expected to follow during the course of itsevolution. This curve predicts the combination of temperature and luminosity that a star will have during part or all of its lifetime.&#91;6&#93;", "https://en.wikipedia.org/wiki/Evolutionary_track"], ["Extinction", "Extinctionis theabsorptionandscatteringofelectromagnetic radiationby matter (dust and gas) between an emittingastronomical objectand theobserver. Atmospheric extinction varies by the wavelength of the radiation, with theattenuationbeing greater for blue light than for red.", "https://en.wikipedia.org/wiki/Extinction_(astronomy)"], ["Faculae", "Faculae(plural of facula) are bright spots on a star'sphotosphereformed by concentrations ofmagnetic field lines. For the Sun, they are most readily observed near the solar limb. An increase in faculae as a result of a stellar cycle increases the star's total irradiance.", "https://en.wikipedia.org/wiki/Facula"], ["field galaxy", "Afield galaxyis a galaxy that does not belong to a larger cluster of galaxies, but is gravitationally alone.", "https://en.wikipedia.org/wiki/Field_galaxy"], ["star cluster", "Afield staris a randomly situated star that lies along the line of sight to a group of physically associated stars under study, such as astar cluster. These field stars can contaminate the results for a study and so they need to be identified.&#91;7&#93;", "https://en.wikipedia.org/wiki/Star_cluster"], ["Flare star", "Flare staris a class ofvariable starsthat undergo sudden, dramatic increases in brightness due tomagnetic activityon its surface. This change on brightness occurs across theelectromagnetic spectrumfromradiowaves toX-rays. Most flare stars are faintred dwarfs.", "https://en.wikipedia.org/wiki/Flare_star"], ["Fulton gap", "TheFulton gaprefers to the uncommonness of planets having a size between 1.5 and 2 times that of Earth.", "https://en.wikipedia.org/wiki/Fulton_gap"], ["Galactic nucleus", "Galactic nucleusor core is the region at the center of a galaxy that is usually host to a tight concentration of stars and gas. It almost always includes asupermassive black hole, which, when active, can generate a much higher luminosity in a compact region than its surroundings. This excess luminosity is known as anactive galactic nucleus, and the brightest such active galaxies are calledquasars.", "https://en.wikipedia.org/wiki/Galactic_nucleus"], ["Galactic tide", "Galactic tideis thetidal forceexperienced by objects subject to thegravitational fieldof a galaxy such as the Milky Way.", "https://en.wikipedia.org/wiki/Galactic_tide"], ["Galilean moons", "Galilean moonsare the moons of Jupiter that were discovered byGalileo Galileiin 1610. They consist of the moonsIo,Europa,Ganymede,Callisto, and were the first objects found to orbit another planet.", "https://en.wikipedia.org/wiki/Galilean_moons"], ["Gamma-ray burst", "Gamma-ray burst(GRB) is a cataclysmic event that generates a brief but intense outburst ofgamma rayradiation, which can be detected from billions oflight yearsaway. The source of most GRBs is theorized to besupernovaorhypernovaexplosions of high-mass stars. Short GRBs may result from the collision ofneutron stars.", "https://en.wikipedia.org/wiki/Gamma-ray_burst"], ["Geometric albedo", "Geometric albedois the ratio of the brightness of an astronomical body at aphase angleof zero to anidealizedflat, fully reflecting,diffusively scattering(Lambertian) disk with the same cross-section. It is a measure of how much of the incoming illumination is being scattered back toward an observer and has a value between zero and one.", "https://en.wikipedia.org/wiki/Geometric_albedo"], ["Globular cluster", "Globular clusteris a tight, spherical conglomeration of many thousands stars that are gravitationally-bound to each other and orbit a galactic core as a satellite. They differ fromopen clustersin having a much higher combined mass, with a typical life span extending for billions of years.", "https://en.wikipedia.org/wiki/Globular_cluster"], ["gravitational lens", "Agravitational lensis a large distribution of mass, such as agalactic cluster, that can bend passing light from a distant source by a noticeable degree. The effect can make background objects take on a ring or arc shape.", "https://en.wikipedia.org/wiki/Gravitational_lens"], ["H II region", "AnH II regionis an ionizednebulapowered by young, massiveO-type stars.Ultravioletphotonsfrom these hot stars ionize gas in the surrounding environment, and the nebular gas shines brightly inspectral lines of hydrogenand other elements.  Because O-type stars have short lifetimes (typically a few million years), the presence of an H II region indicates that massive star formation has taken place recently at that location. H II regions are often found in the arms ofspiral galaxiesand in star-formingirregular galaxies.", "https://en.wikipedia.org/wiki/H_II_region"], ["Hertzsprung–Russell diagram", "HertzsprungRussell diagramis a plot ofluminosityversuseffective temperaturefor a population of stars. Depending on the usage, the star's absolute magnitude may be substituted for luminosity, and itscolor indexorspectral typefor the temperature. Depending on their mass and composition, single stars follow specifictracksacross this chart over the course of theirevolution. Hence, knowing a star's mass andmetallicityallows the age to be estimated. Stars of similar types are also found grouped together in specific regions of the chart, including themain sequence,red giant, andwhite dwarfstars.", "https://en.wikipedia.org/wiki/Hertzsprung%E2%80%93Russell_diagram"], ["Hill sphere", "Hill sphereorHill radiusis the approximate region around anastronomical objectwhere its gravitational attraction will dominate the motions of satellites. It is computed with respect to the next most gravitationally-attractive object, such as the nearest star or the galactic core. Satellites moving outside this radius will tend to be perturbed away from the main body.&#91;8&#93;", "https://en.wikipedia.org/wiki/Hill_sphere"], ["elliptical", "Hypergalaxyrefers to a system consisting of a large galaxy that is accompanied by multiple smaller satellite galaxies (oftenelliptical) as well as itsgalactic corona. The Milky Way and Andromeda galaxy systems are examples of hypergalaxies.&#91;9&#93;", "https://en.wikipedia.org/wiki/Dwarf_elliptical_galaxy"], ["Inferior planet", "Inferior planetis an archaic term that is sometimes used to refer to the planetsMercuryandVenus. The name originated from the fact that they orbit closer to theSunthan the Earth and hence, in thegeocentriccosmologyofPtolemy, both appeared to travel with the Sun across the sky. This is in contrast to so-calledsuperior planets, such asMars, that appeared to move independently of the Sun.", "https://en.wikipedia.org/wiki/Inferior_planet"], ["Interstellar medium", "Interstellar mediumis the matter that exists in the space between the stars in a galaxy. This medium mainly consists of hydrogen and helium, but it is enhanced by traces of other elements contributed by matter expelled from stars.", "https://en.wikipedia.org/wiki/Interstellar_medium"], ["Interstellar reddening", "Interstellar reddeningis an effect produced by the incremental absorption and scattering of electromagnetic energy from interstellar matter, an effect known asextinction. This effect causes the more distant objects such as stars to appear redder and dimmer than expected. It is not to be confused with the separate phenomenon ofred shift.", "https://en.wikipedia.org/wiki/Interstellar_reddening"], ["Isochrones", "Isochronesare curves on theHertzsprung-Russell diagramthat represent theevolutionarypositions of stars having the same age but differing masses. This is in contrast to anevolutionary track, which is a plot of stars having the same mass but differing ages. In fact, multiple evolutionary tracks can be used to build isochrones by putting curves through equal-age points along the tracks. When the mass of a star can be determined, an isochrone can be used to estimate the star's age.", "https://en.wikipedia.org/wiki/Tautochrone_curve"], ["Jeans instability", "Jeans instabilityis a physical state in which an interstellar cloud of gas will begin to undergo collapse and form stars. A cloud can become unstable against collapse when it cools sufficiently or has perturbations of density, allowing gravity to overcome the gas pressure.", "https://en.wikipedia.org/wiki/Jeans_instability"], ["Libration", "Librationis a slight oscillating motion of the Moon as seen from the Earth. This tipping and tilting movement is the result of the elliptical orbit of the Moon. It can allow normally hidden parts of the Moon's far side to be viewed along the limb.", "https://en.wikipedia.org/wiki/Libration"], ["Limb darkening", "Limb darkeningis an optical effect seen in stars (including theSun), where the center part of the disk appears brighter than the edge orlimbof the image.", "https://en.wikipedia.org/wiki/Limb_darkening"], ["Magnetosphere", "Magnetosphereis a mostly convex region formed when a plasma, such as thesolar wind, interacts with the magnetic field of a body, such as a planet or star.", "https://en.wikipedia.org/wiki/Magnetosphere"], ["Magnitude", "Magnitudeis a numerical scale indicating the brightness of anastronomical object. It is alogarithmicmeasure where the lower the value, the brighter the object. By convention, a first magnitude star is 100 times as bright as a sixth magnitude star. Magnitude 6 is considered the lower limit of objects that can be seen with the naked eye, although this can vary depending on seeing conditions and eyesight.", "https://en.wikipedia.org/wiki/Magnitude_(astronomy)"], ["Main sequence", "Main sequenceis a category of stars that form a continuous and distinctive band on plots of stellar temperature versus brightness. These stars are characterized by being inhydrostatic equilibriumand undergoingnuclear fusionofhydrogen-1in their core region. For example, the Sun is a main sequence star.", "https://en.wikipedia.org/wiki/Main_sequence"], ["Meridian", "Meridianis a line running north-south across the sky and passing through the point directly overhead, known as thezenith.", "https://en.wikipedia.org/wiki/Meridian_(astronomy)"], ["Messier object", "Messier objectis one of a set of 110 'nebulous' objects, of which 103 were catalogued by FrenchcomethunterCharles Messierbetween 1771 and 1781.", "https://en.wikipedia.org/wiki/Messier_object"], ["Meteor", "Meteoris the ionization trail produced by a meteoroid as it enters the Earth's atmosphere.", "https://en.wikipedia.org/wiki/Meteor"], ["Meteoroid", "Meteoroidis a small rock or boulder that has entered a planetary atmosphere. If it survives to reach the ground, it is then termed ameteorite.", "https://en.wikipedia.org/wiki/Meteoroid"], ["Meteor shower", "Meteor showeris a series of meteors that seemingly radiate from a point on the night sky. These are produced by debris left over from a larger body, such as a comet, and hence they follow roughly the same orbit. This makes many meteor showers predictable events as they reoccur every year.", "https://en.wikipedia.org/wiki/Meteor_shower"], ["Metallicity", "Metallicityis the abundance of elements other than hydrogen and helium. Note that these 'metals' include elements that are not typically considered metallic.", "https://en.wikipedia.org/wiki/Metallicity"], ["variable star", "Microvariableis a stellar object such as avariable starthat undergoes very small variations in luminosity. Detecting microvariability will typically require sufficient observations to rule outrandom erroras a source.&#91;10&#93;", "https://en.wikipedia.org/wiki/Variable_star"], ["Minor planet", "Minor planetis an object in direct orbit around the Sun that is neither a dominantplanetnor originally classified as acomet. A moon is not a minor planet because it is orbiting another body.", "https://en.wikipedia.org/wiki/Minor_planet"], ["Molecular clouds", "Molecular cloudsareinterstellar cloudswhere the conditions allow molecules to form, includingmolecular hydrogen.", "https://en.wikipedia.org/wiki/Molecular_cloud"], ["Morning width", "Morning widthorrise widthis the horizontal angular distance between the riseazimuthof acelestial bodyand the East direction.", "https://en.wikipedia.org/wiki/Morning_width"], ["Moving group", "Moving grouporstellar associationis a loose grouping of stars that are traveling together through space. Although the members were formed together in the same molecular cloud, they have since moved too far apart to be gravitationally bound as a cluster.", "https://en.wikipedia.org/wiki/Moving_group"], ["Nebula", "Nebularefers to a region of indistinct nebulosity. In modern terms, it means aninterstellar cloudofdust,hydrogen,heliumand otherionized gases. Historically, it was also used to refer to extended sources of luminosity that could not be resolved into their individual components, such asstar clustersand galaxies.", "https://en.wikipedia.org/wiki/Nebula"], ["Neutron star", "Neutron staris a type ofstellar remnantthat is composed almost entirely ofneutrons, which is a type ofsubatomic particlewith no electrical charge. Typically, a neutron star has a mass between 1.35 and about 2.0 times the mass of the Sun, but with a radius of only 12&#160;km (7.5&#160;mi).", "https://en.wikipedia.org/wiki/Neutron_star"], ["Number density", "Number densityis the quantity of some specified particle or object class per unit volume. For atoms, molecules or subatomic particles, the volume is typically in cm3or m3. With stars, cubic parsecs (pc3) are often used.", "https://en.wikipedia.org/wiki/Number_density"], ["OB association", "OB associationis a group of massive stars that are not gravitationally bound to each other, but move together through space in a loose association. The OB in the name is a reference to stars of stellar classification O and B.", "https://en.wikipedia.org/wiki/OB_association"], ["Opacity", "Opacityis a measure of the resistance of a medium to the radiative transmission of energy. Within a star, it is an important factor in determining whetherconvectionoccurs.", "https://en.wikipedia.org/wiki/Opacity_(optics)"], ["Open cluster", "Open clusteris a gravitationally-bound group of up to a thousand stars that formed together in the samemolecular cloud.", "https://en.wikipedia.org/wiki/Open_cluster"], ["Opposition", "Oppositionoccurs when two celestial objects are on opposite sides of the sky. This occurs, for example, when a planet makes its closest approach to the Earth, placing it in opposition to the Sun.", "https://en.wikipedia.org/wiki/Opposition_(planets)"], ["schematic", "Orbit plotororbital plotis aschematicdiagram of a completeorbit. For a binary system, it is typically presented from the primary component'sframe of reference.&#91;11&#93;", "https://en.wikipedia.org/wiki/Schematic"], ["Orbital elements", "Orbital elementsare parameters that uniquely define an orbit.", "https://en.wikipedia.org/wiki/Orbital_elements"], ["Parsec", "Parsecis aportmanteauof the wordsparallaxandsecond. This is the distance at which a star would show a parallax shift of exactly onearcsecondas observed from Earth's orbit. It is equal to 3.2616&#160;light yearsor 206,265&#160;Astronomical Units.", "https://en.wikipedia.org/wiki/Parsec"], ["Perhelion", "Perhelionis the point in the planet's orbit where it is closest to the sun.", "https://en.wikipedia.org/wiki/Perihelion_and_aphelion"], ["Periapsis", "Periapsisis the point of closest approach between two orbiting objects.", "https://en.wikipedia.org/wiki/Periapsis"], ["Phase angle", "Phase angleis theelongationor angle between an orbiting body and the Sun as viewed from a particular perspective such as the Earth. It determines the amount of a planet or moon's visible surface that lies in shadow.Inferior planetssuch asVenusgenerally have a low phase angle as seen from Earth, so they are often viewed as a crescent.Superior planetssuch asMarsandJupiterusually have a high phase angle, so little of the shadowed side is visible.", "https://en.wikipedia.org/wiki/Phase_angle_(astronomy)"], ["Planetary differentiation", "Planetary differentiationis the process of separating out different constituents of a planetary body, causing it to develop compositionally distinct layers (such as a metallic core).", "https://en.wikipedia.org/wiki/Planetary_differentiation"], ["Precession", "Precessioncan refer to a slow change in the orientation of an object's axis of rotation. For the Earth, this is referred to as theprecession of the equinoxes. Apsidal precession means a steady change in the orientation of an orbit, such as the precession in the orbit ofMercurythat was explained by the theory ofgeneral relativity.", "https://en.wikipedia.org/wiki/Precession_(astronomy)"], ["angular separation", "Projected separationis the minimum physical separation of two astronomical objects, as determined from theirangular separationand estimated distance.&#91;12&#93;For planets anddouble stars, this distance is usually given inAstronomical Units. The actual separation of the two objects depends on the angle of the line between the two objects to theline-of-sightof the observer.", "https://en.wikipedia.org/wiki/Angular_separation"], ["Proper motion", "Proper motionis the rate of angular motion of an object over an interval of time, usually years. For stars, this is typically given in milliarcseconds per year.", "https://en.wikipedia.org/wiki/Proper_motion"], ["Protostar", "Protostaris a concentration of mass formed out of the contraction of a collapsing interstellar cloud. Once sufficient mass has fallen onto this central core, it becomes apre-main-sequence star.", "https://en.wikipedia.org/wiki/Protostar"], ["stellar magnetic field", "Quadratic field strengthis a method of computing the mean strength of a varyingstellar magnetic field. It is determined by taking theroot mean squareof a series oflongitudinalmagnetic field strengthmeasurements taken at different time periods.&#91;13&#93;", "https://en.wikipedia.org/wiki/Stellar_magnetic_field"], ["Quasar", "Quasar, or \"quasi-stellar radio source\", is a distant, point-like energy source originating from a powerfulactive galactic nucleus. Its luminosity is generated byaccretionof gas onto asupermassive black hole. Quasars emit radiation across theelectromagnetic spectrumfromradio wavestoX-rays, and theirultravioletandopticalspectra are characterized by strong, broademission lines.", "https://en.wikipedia.org/wiki/Quasar"], ["Radial velocity", "Radial velocityis the velocity of an object along the line of sight to the observer, which in astronomy is usually determined viaDoppler spectroscopy. Positive values are used to indicate a receding object. An object such as a star can undergo changes in its radial velocity because of thegravitational perturbationof another body, or because of radial pulsations of its surface. The latter, for example, occurs with aBeta Cephei variablestar.", "https://en.wikipedia.org/wiki/Radial_velocity"], ["Red-giant branch", "Red-giant branchis a conspicuous trail of enlarged red stars found on theHertzsprungRussell diagramfor a typicalglobular cluster. It begins at themain sequenceturnoff point and extends toward the higher luminosity and lower temperature range until reaching the red-giant tip. This branch consists of older stars that have evolved away from the main sequence but have not yet initiatedhelium fusionin theircore region.", "https://en.wikipedia.org/wiki/Red-giant_branch"], ["Right ascension", "Right ascension, in theequatorial coordinate system, is the celestial equivalent of terrestriallongitude. It divides thecelestial equatorinto 24 hours, each of 60 minutes.", "https://en.wikipedia.org/wiki/Right_ascension"], ["Roche limit", "Roche limitis the distance from an astronomical object where thetidal forcematches an orbiting body's gravitational self-attraction. Inside this limit, the tidal forces will cause the orbiting body to disintegrate, usually to disperse and form aring. Outside this limit, loose material will tend tocoalesce.", "https://en.wikipedia.org/wiki/Roche_limit"], ["Rosseland optical depth", "Rosseland optical depth(&#964;R) is anextinction coefficientof an atmosphere, which describes the net opacity to radiation at a given depth. Seeoptical depth.&#91;14&#93;", "https://en.wikipedia.org/wiki/Rosseland_mean_opacity"], ["star spots", "Rotational modulationcauses the luminosity of a star to vary as rotation carriesstar spotsor other localized activity across the line of sight. Examples includeRS CVnandBY Dra variables.&#91;15&#93;", "https://en.wikipedia.org/wiki/Star_spot"], ["Secular motion", "Secular motionis a change in movement that happens over a very long time period.&#91;16&#93;Examples include theperihelion precession of Mercury, thetidal accelerationof the Earth-Moon system, andprecession of the Earth's axis.", "https://en.wikipedia.org/wiki/Secular_motion"], ["Semi-major axis", "Semi-major axisis half the maximum length of anellipse. It is used to give a physical dimension to a two-bodyKeplerian orbit, such as for a binary star system. However, when the distance to the system is unknown, the semi-major axis may be given as an angle.", "https://en.wikipedia.org/wiki/Semi-major_axis"], ["Solstice", "Solsticeoccurs when the Sun reaches its most northerly or southerly point in the Sky as seen from Earth. It occurs around June 20 and December 21 each year. The Summer Solstice has the longest duration of daylight and the shortest period of night time, while the reverse is true for the Winter Solstice.", "https://en.wikipedia.org/wiki/Solstice"], ["Spectroscopic binary", "Spectroscopic binaryis a type ofbinary starsystem where the individual components have not been resolved with a telescope. Instead, the evidence for the binarity comes from shifts observed in thespectrum. This is caused by theDoppler effectas theradial velocityof the components change over the course of each orbit.", "https://en.wikipedia.org/wiki/Spectroscopic_binary"], ["Starburst galaxy", "Starburst galaxyis a galaxy that has an anomalously high rate of star formation. The criteria for a starburst is a star formation rate that would normally consume the galaxy's available supply of unbound gas within a time period shorter than the age of the galaxy. Most starbursts occur as a result of galactic interactions, such as amerger.", "https://en.wikipedia.org/wiki/Starburst_galaxy"], ["Starfield", "Starfieldorstar fieldrefers to a set of stars visible in an arbitrarily-sized field of view of a telescope, usually in the context of some region of interest within the celestial sphere.", "https://en.wikipedia.org/wiki/Starfield_(astronomy)"], ["Stellar atmosphere", "Stellar atmosphere, or stellar envelope, is the outermost region of a star. Although it forms only a small portion of the star's mass, for some evolved stars the stellar envelope can form a significant fraction of the radius.", "https://en.wikipedia.org/wiki/Stellar_atmosphere"], ["Stellar classification", "Stellar classificationis the categorization ofstarsbased upon theirspectrum. The modernMK spectral classificationscheme is a two-dimensional classification based on temperature and luminosity.", "https://en.wikipedia.org/wiki/Stellar_classification"], ["Superior planet", "Superior planetis an archaic term that is sometimes used to refer to planets that orbit further from the Sun than the Earth, such asSaturn. The name originated fromgeocentriccosmologyofPtolemy.", "https://en.wikipedia.org/wiki/Superior_planet"], ["Synodic period", "Synodic periodis the time taken for a given object to make one complete orbit about another object, as calculated respect to the background stars.", "https://en.wikipedia.org/wiki/Synodic_period"], ["Syzygy", "Syzygyis the straight-line configuration of three celestial bodies in a gravitational system.", "https://en.wikipedia.org/wiki/Syzygy_(astronomy)"], ["telluric contamination", "Telluric starshave nearly featureless continuum spectra that can be used to correct for the effect oftelluric contaminationof theEarth's atmosphereon the spectra of other stars. For example, water vapor in the atmosphere creates significant telluric absorption bands at wavelengths above 6800. These features need to be corrected for in order to reach a more accurate spectrum.&#91;17&#93;", "https://en.wikipedia.org/wiki/Telluric_contamination"], ["Terminator", "Terminatoris the line that divides the illuminated side of a moon or planet from the dark side. The line moves as the object rotates with respect to the Sun.", "https://en.wikipedia.org/wiki/Terminator_(solar)"], ["Milky Way", "Thin disk populationrefers to the layer of theMilky Waygalaxy where the spiral arms are found and where most of the star formation takes place. It is about 300400 parsecs (9801,300 light-years) deep and centered on thegalactic plane. Stars belonging to this population generally follow orbits that lie close to this plane.&#91;18&#93;This is in contrast to members of the thick disk population and halo stars.", "https://en.wikipedia.org/wiki/Milky_Way"], ["tidal acceleration", "Tidal brakingortidal accelerationis the transfer of momentum between an astronomical body and an orbiting satellite as the result oftidal forces. This can cause changes in the rotation periods for both bodies as well as modification of their mutual orbit. A satellite in aprogradeorbit will gradually recede from the primary body, while slowing the rotation rate of both bodies.", "https://en.wikipedia.org/wiki/Tidal_acceleration"], ["Tidal locking", "Tidal lockingis a net result of continued tidal braking such that, over the course of an orbit, there is no net transfer ofangular momentumbetween anastronomical bodyand its gravitational partner. When the orbital eccentricity is low, the result is that the satellite orbits with the same face always pointed toward its primary.&#91;19&#93;The Moon is tidally locked with the Earth.", "https://en.wikipedia.org/wiki/Tidal_locking"], ["&#91;20&#93;", "Tidal streamrefers to the streams of stars and gas that are stripped from gas clouds and star clusters because of interaction with the gravitational field of a galaxy such as the Milky Way.&#91;20&#93;", "https://en.wikipedia.org#cite_note-sanders2015-20"], ["obliquity", "Tilt erosionis the gradual reduction of theobliquityof an orbiting satellite due to tidal interactions.&#91;21&#93;", "https://en.wikipedia.org/wiki/Obliquity"], ["Transit", "Transitis an astronomical event where an object passes across the face of a much larger body. An example of this event is thetransit of Venusacross the face of the Sun in 2004. Because a transit results in a decrease in the net luminosity from the two objects, thetransit methodis used to detectextrasolar planetsas they pass in front of their host stars. Transits by objects that appear roughly the same size or larger than the body they are transiting are calledoccultations.", "https://en.wikipedia.org/wiki/Astronomical_transit"], ["Tully–Fisher relation", "TullyFisher relationis anempirical relationshipbetween the mass or intrinsicluminosityof aspiral galaxyand itsangular velocityoremission linewidth. It can be used to estimate the distance of a galaxy, and hence forms a rung on theCosmic Distance Ladder.", "https://en.wikipedia.org/wiki/Tully%E2%80%93Fisher_relation"], ["Variable star", "Variable staris a star that seen to vary in brightness. This variation may be periodic, with one or more cycles that last hours, days, months, or even years. Some stars vary in an irregular manner, while others undergo cataclysmic changes in brightness. Other forms of variability are intrinsic changes to the radial velocity or the profile ofspectral lines.", "https://en.wikipedia.org/wiki/Variable_star"], ["Vernal equinox", "Vernal equinoxis the point in the year when the Sun appears to cross thecelestial equator, while generally trending northward at each zenith passage. It represents the moment when theNorth Poleof the Earth begins to tilt toward the Sun.", "https://en.wikipedia.org/wiki/Vernal_equinox"], ["spectral lines", "Weak-line staris a reference to the faintness of thespectral linesfor a star compared to standard stars with the samestellar classification. Since most absorption lines are caused by elements other than hydrogen and heliumwhat astronomers refer to as \"metals\"these are sometimes called metal weak stars.&#91;22&#93;", "https://en.wikipedia.org/wiki/Spectral_line"], ["White dwarf", "White dwarfis a type ofstellar remnantcomposed mostly ofelectron-degenerate matter. A white dwarf lacks the mass needed to continue thenuclear fusionprocess with its constituent atoms, so the object's energy output normally comes from radiative cooling. (But seenovaandType Ia supernova.)", "https://en.wikipedia.org/wiki/White_dwarf"], ["Wilson–Bappu effect", "WilsonBappu effectis a correlation between the width of the singly-ionized calcium K-line (Ca II K) at 3933&#160;and theabsolute visual magnitudeof the emittinglate-type stars. This linear relation makes it useful for determining the distances of G, K, and M-type stars.&#91;23&#93;", "https://en.wikipedia.org/wiki/Wilson%E2%80%93Bappu_effect"], ["active galactic nucleus", "X-ray bright optically normal galaxy(XBONG) is a seemingly normal galaxy that does not appear to have anactive galactic nucleus, yet displays an anomalous level of excessX-ray emission.&#91;24&#93;", "https://en.wikipedia.org/wiki/Active_galactic_nucleus"], ["Zenith", "Zenithis the point on the sky that is directly overhead, from the perspective of a particular location on the Earth.", "https://en.wikipedia.org/wiki/Zenith"], ["Zero-age main sequence", "Zero-age main sequence(ZAMS) is the sequence of positions along theHertzsprungRussell diagramachieved by newly formed, chemically-homogeneous stars that have finished contracting and have reachedhydrostatic equilibrium, with energy being derived solely fromnuclear fusion.&#91;25&#93;", "https://en.wikipedia.org/wiki/Zero-age_main_sequence"], ["Zodiac", "Zodiacis the apparent path of the Sun across thecelestial sphereas seen from Earth's orbit. It crosses a band of twelve Zodiac constellations, through which the Moon and visible planets are seen to travel.", "https://en.wikipedia.org/wiki/Zodiac"]]