var biowords = [["abiotic component", "Any non-living chemical or physical part of the environment that affects living organisms and the functioning of ecosystems, such as theatmosphereand water resources.", "https://en.wikipedia.org/wiki/Abiotic_component"], ["abscisic acid", "Aplant hormonewith the formula C15H20O4.", "https://en.wikipedia.org/wiki/Abscisic_acid"], ["abscission", "The shedding of flowers, leaves and/or fruit following formation of scar tissue in a plant.", "https://en.wikipedia.org/wiki/Abscission"], ["absolute zero", "The lowest theoretically attainable temperature, at which thekinetic energyof atoms and molecules is minimal. It is equivalent to 0kelvins, or −273.15degrees Celsius, or −459.67degrees Fahrenheit.", "https://en.wikipedia.org/wiki/Absolute_zero"], ["absorption", "A process in which one substance permeates another. Afluidpermeates or is dissolved by a liquid or solid. Skin absorption is a route by which substances can enter the body through the skin.", "https://en.wikipedia.org/wiki/Absorption_(skin)"], ["absorption spectrum", "The spectrum ofelectromagnetic radiationthat has passed through a medium which absorbs radiation of certainwavelengths.", "https://en.wikipedia.org/wiki/Absorption_spectrum"], ["abyssal zone", "The deepsea(2000 meters or more) where there is no light.", "https://en.wikipedia.org/wiki/Abyssal_zone"], ["acclimatization", "Adaptation to a newclimate, as with a new temperature or altitude or environment.", "https://en.wikipedia.org/wiki/Acclimatization"], ["acetyl-CoA", "A molecule that is involves in many biochemical reactions inprotein,carbohydrateand lipid metabolism.", "https://en.wikipedia.org/wiki/Acetyl-CoA"], ["acetylcholine", "An organic molecule that functions as aneurotransmitterin the brain and body of many types of animals, including humans.", "https://en.wikipedia.org/wiki/Acetylcholine"], ["acid precipitation", "Rainor any other form of precipitation containingacidsthat form in the atmosphere when industrial gas emissions (especiallysulfur dioxideandnitrogen oxides) combine withwater.", "https://en.wikipedia.org/wiki/Acid_precipitation"], ["acoelomate", "An animal, such as aflatwormor ajellyfish, that lacks a fluid-filled body cavity between the body wall and digestive tract (thecoelom) Rather, semi-solid mesodermal tissues between the gut and body wall hold the animal's organs in place.", "https://en.wikipedia.org/wiki/Acoelomate"], ["acrosome", "An organelle that expands over the anterior half of the head in thespermatozoa(sperm cells) of many animals including humans.", "https://en.wikipedia.org/wiki/Acrosome"], ["actin", "One of theproteinsinto whichactomyosincan be split; can exist in either a globular or a fibrous form.", "https://en.wikipedia.org/wiki/Actin"], ["action potential", "The localvoltagechange across thecell wallas anerve impulseis transmitted.", "https://en.wikipedia.org/wiki/Action_potential"], ["activation energy", "Theenergythat an atomic system must acquire before a process (such as an emission or reaction) can occur.", "https://en.wikipedia.org/wiki/Activation_energy"], ["active site", "The part of anenzymeorantibodywhere thechemical reactionoccurs.", "https://en.wikipedia.org/wiki/Active_site"], ["active transport", "Transport of a substance (as a protein ordrug) across acell membraneagainst theconcentration gradient; unlikepassive transport, it requires an expenditure of energy.", "https://en.wikipedia.org/wiki/Active_transport"], ["adaptive immune system", "One of two mainimmunitystrategies found in vertebrates that inhibits or eliminatespathogensthrough the actions of highly specialized systemic cells and processes.", "https://en.wikipedia.org/wiki/Adaptive_immune_system"], ["adaptive radiation", "The process in which organisms diversify rapidly from an ancestral species into a multitude of new forms, particularly when a change in theenvironmentmakes new resources available, creates new challenges, or opens new environmental niches.", "https://en.wikipedia.org/wiki/Adaptive_radiation"], ["adenine", "apurine-derived nucleobase.", "https://en.wikipedia.org/wiki/Adenine"], ["adenosine triphosphate", "anucleotidederived fromadenosinethat occurs in muscle tissue; the major source of energy for cellular reactions. The chemical formula for ATP is C10H16N5O13P3.", "https://en.wikipedia.org/wiki/Adenosine_triphosphate"], ["adenylate cyclase", "An enzyme that catalyzes the formation ofcyclic AMPfrom ATP.", "https://en.wikipedia.org/wiki/Adenylate_cyclase"], ["adipose tissue", "The loose connective tissue, also known as body fat or fat, that is made of mostlyadipocytes.", "https://en.wikipedia.org/wiki/Adipose_tissue"], ["aerobic", "Depending on freeoxygenor air.", "https://en.wikipedia.org/wiki/Aerobic_organism"], ["aerobiology", "The study of organic particles, such as bacteria, fungal spores, very small insects, pollen grains and viruses, which are passively transported by the air.", "https://en.wikipedia.org/wiki/Aerobiology"], ["agriculture", "The practice of cultivating land, growing food, and raising stock.", "https://en.wikipedia.org/wiki/Agriculture"], ["agrobiology", "The study ofplant nutritionand growth, especially as a way to increase crop yield.", "https://en.wikipedia.org/wiki/Agrobiology"], ["allopatric speciation", "It is a form of speciation that occurs when biological populations of the same species become isolated from each other to an extent that prevents or interferes with genetic interchange.", "https://en.wikipedia.org/wiki/Allopatric_speciation"], ["allosteric enzyme", "These areenzymesthat change their conformational ensemble upon binding of an effector, which results in an apparent change in binding affinity at a different ligand binding site.", "https://en.wikipedia.org/wiki/Allosteric_enzyme"], ["amino acid", "A class oforganic compoundscontaining anamino groupand acarboxylic acidgroup.", "https://en.wikipedia.org/wiki/Amino_acid"], ["amniote", "Organisms that produce aneggcomposed of shell and membranes that creates a protected environment in which theembryocan develop out of water.", "https://en.wikipedia.org/wiki/Amniote"], ["amphiphile", "a chemical compound that has both hydrophilic and lipophilic  properties.", "https://en.wikipedia.org/wiki/Amphiphile"], ["analogous structures", ".", "https://en.wikipedia.org/wiki/Analogous_structures"], ["anatomy", "The branch ofmorphologythat deals with the structure of animals.", "https://en.wikipedia.org/wiki/Anatomy"], ["aneuploidy", "The presence of an abnormal number of chromosomes in a cell.", "https://en.wikipedia.org/wiki/Aneuploidy"], ["antibiotic", "A type of antimicrobial drug used in the treatment and prevention of bacterial infections. Also called anantibacterial.", "https://en.wikipedia.org/wiki/Antibiotic"], ["anticodon", "A unit made up of three nucleotides that correspond to the three bases of the codon on the mRNA.", "https://en.wikipedia.org/wiki/Transfer_RNA#Anticodon"], ["arachnology", "The scientific study ofspiders,scorpions,pseudoscorpions, andharvestmen, collectively calledarachnids.", "https://en.wikipedia.org/wiki/Arachnology"], ["artificial selection", "Professionals study thegenotypeandphenotypeof parent organisms in the hope of producing ahybridthat possesses many of the desirable characteristics found in their parents. Also known asselective breeding.", "https://en.wikipedia.org/wiki/Selective_breeding"], ["asexual reproduction", "A type ofreproductioninvolving a single parent that results in offspring that are genetically identical to the parent.", "https://en.wikipedia.org/wiki/Asexual_reproduction"], ["astrobiology", "The branch of biology concerned with the effects of outer space on living organisms and the search for extraterrestrial life.", "https://en.wikipedia.org/wiki/Astrobiology"], ["atom", "The smallest component of anelementhaving the chemical properties of the element.", "https://en.wikipedia.org/wiki/Atom"], ["autoimmunity", "The system of immune responses of an organism against its own healthy cells and tissues.", "https://en.wikipedia.org/wiki/Autoimmunity"], ["autotrophic", "automeans \"self\" andtrophemeans \"nourishing or producing\".", "https://en.wikipedia.org/wiki/Autotrophic"], ["B cell", "A type of lymphocyte in the humoral immunity of the adaptive immune system.", "https://en.wikipedia.org/wiki/B_cell"], ["bacteria", "An enormous and diverse clade of microscopic,prokaryotic, single-celledorganisms which lack a truenucleus. They represent one of the three biologicaldomains.", "https://en.wikipedia.org/wiki/Bacteria"], ["bacteriophage", "Avirusthat infects and multiplies within bacteria.", "https://en.wikipedia.org/wiki/Bacteriophage"], ["Barr body", "The inactive X chromosome in a female somatic cell, rendered inactive in a process called lyonization, in those species in which sex is determined by the presence of the Y (including humans) or W chromosome rather than the diploidy of the X or Z.", "https://en.wikipedia.org/wiki/Barr_body"], ["basal body", "An organelle formed from acentriole, and a short cylindrical array of microtubules. Also called abasal granule, akinetosome, and in older cytological literature, ablepharoplast.", "https://en.wikipedia.org/wiki/Basal_body"], ["behavioral ecology", "The study of the evolutionary basis for animal behavior due to ecological pressures.", "https://en.wikipedia.org/wiki/Behavioral_ecology"], ["benthic zone", "The ecological region at the lowest level of a body of water such as an ocean or a lake, including the sediment surface and some sub-surface layers.", "https://en.wikipedia.org/wiki/Benthic_zone"], ["bile", "A dark green to yellowish-brown fluid, produced by the liver of most vertebrates, which aids the digestion oflipidsin the small intestine. Also calledgall.", "https://en.wikipedia.org/wiki/Bile"], ["binary fission", "The process by which one prokaryotic cell divides into two identical daughter cells.", "https://en.wikipedia.org/wiki/Fission_(biology)"], ["binomial nomenclature", "A formal system of classifyingspeciesof living things by giving each a name composed of two parts, both of which use Latin grammatical forms, although they can be based on words from other languages.", "https://en.wikipedia.org/wiki/Binomial_nomenclature"], ["biocatalysis", "The process ofcatalysisin biological systems. In biocatalytic processes, natural catalysts, such as protein enzymes, perform chemical transformations on organic compounds.", "https://en.wikipedia.org/wiki/Biocatalysis"], ["biochemistry", "The branch of biology that explores the chemical processes within and related to living organisms.", "https://en.wikipedia.org/wiki/Biochemistry"], ["biodiversity", "A contraction of \"biological diversity\" generally referring to the variety and variability of life on Earth.", "https://en.wikipedia.org/wiki/Biodiversity"], ["bioengineering", "The application of concepts and methods of biology to solve real-world problems related to the life sciences or the application thereof.", "https://en.wikipedia.org/wiki/Bioengineering"], ["bioenergetics", "The study of the transformation of energy in living organisms.", "https://en.wikipedia.org/wiki/Bioenergetics"], ["biogeography", "The study of the distribution of species and ecosystems in geographic space and through geological time. Organisms and biological communities often vary in a regular fashion along geographic gradients of latitude, elevation, isolation and habitat area.", "https://en.wikipedia.org/wiki/Biogeography"], ["bioinformatics", "The application of computer technology to the management of biological information.", "https://en.wikipedia.org/wiki/Bioinformatics"], ["biological organization", "the hierarchy of complex biological structures and systems, designed to define life through a reductionist approach.", "https://en.wikipedia.org/wiki/Biological_organization"], ["biology", "The study of life and organisms.", "https://en.wikipedia.org/wiki/Biology"], ["biomass", "Organic matter derived from living or recently living organisms. Biomass can be used as a source of energy and it most often refers to plants or plant-based materials which are not used for food or feed, and are specifically called lignocellulosic biomass.", "https://en.wikipedia.org/wiki/Biomass"], ["biomathematics", "The theoretical use of mathematical models and abstractions of living systems to understand and predict biological problems.", "https://en.wikipedia.org/wiki/Biomathematics"], ["biome", "A very large ecological area on the Earth's surface containing fauna and flora (animals and plants) adapting to their environment. Biomes are often defined by abiotic factors such as climate, topographical relief, geology, soils, and water resources.", "https://en.wikipedia.org/wiki/Biome"], ["biomechanics", "The study of the structure and function of biological systems by means of the methods of \"mechanics\", which is the branch of physics involving analysis of the actions of forces.", "https://en.wikipedia.org/wiki/Biomechanics"], ["biomedical engineering", "The application of engineering principles and design concepts to medicine and biology for healthcare purposes (e.g. diagnostic or therapeutic).", "https://en.wikipedia.org/wiki/Biomedical_engineering"], ["biomedical research", "The pursuit of answers to medical questions. These investigations lead to discoveries, which in turn lead to the development of new preventions, therapies, and cures for problems in human and veterinary health. Biomedical research generally takes two forms: basic science and applied research.", "https://en.wikipedia.org/wiki/Biomedical_research"], ["biomimetic", "The imitation of the models, systems, and elements ofnaturefor the purpose of solving complex human problems.", "https://en.wikipedia.org/wiki/Biomimetic"], ["biomolecule", "A loosely used term formoleculesandionsthat are present in organisms, essential to some typically biological process such ascell division,morphogenesis, or development.", "https://en.wikipedia.org/wiki/Biomolecule"], ["bionics", "The application of biological methods and systems found in nature to the study and design of engineering systems and modern technology. Also known asbiomimetics,biognosis,biomimicry, orbionical creativity engineering.", "https://en.wikipedia.org/wiki/Bionics"], ["biophysics", "The application of approaches traditionally employed in physics to study biological systems.", "https://en.wikipedia.org/wiki/Biophysics"], ["biotechnology", "Biotechnology is the use of living systems and organisms to develop or make products, or \"any technological application that uses biological systems, living organisms or derivatives thereof, to make or modify products or processes for specific use\" (UN Convention on Biological Diversity).", "https://en.wikipedia.org/wiki/Biotechnology"], ["bipedal", "A form of terrestrial locomotion where an organism moves by means of its two rear limbs or legs.", "https://en.wikipedia.org/wiki/Bipedal"], ["blastocyst", "A mammalianblastulain which some differentiation of cells has occurred.", "https://en.wikipedia.org/wiki/Blastocyst"], ["blood", "The red liquid that circulates in the arteries and veins of humans and other vertebrate animals, carrying oxygen to and carbon dioxide from the tissues of the body.", "https://en.wikipedia.org/wiki/Blood"], ["blood-brain barrier", "A semipermeable membrane separating the blood from the cerebrospinal fluid, and constituting a barrier to the passage of cells, particles, and large molecules.", "https://en.wikipedia.org/wiki/Blood-brain_barrier"], ["botany", "The study of plants.", "https://en.wikipedia.org/wiki/Botany"], ["Bowman's capsule", "A cup-like sac at the beginning of the tubular component of anephronin the mammalian kidney that performs the first step in the filtration of blood to form urine. Aglomerulusis enclosed in the sac. Also known ascapsula glomeruliorglomerular capsule.", "https://en.wikipedia.org/wiki/Bowman%27s_capsule"], ["building biology", "A science that leads to natural healthy ecological homes, schools, and workplaces that exist in harmony with the environment.", "https://en.wikipedia.org/wiki/Building_biology"], ["Calvin cycle", ".", "https://en.wikipedia.org/wiki/Light-independent_reactions#Coupling_to_other_metabolic_pathways"], ["capsid", "A covering of viroids.", "https://en.wikipedia.org/wiki/Capsid"], ["carbon fixation", "The conversion process of inorganic carbon (carbon dioxide) to organic compounds by living organisms.", "https://en.wikipedia.org/wiki/Carbon_fixation"], ["carbonate", "Any member of two classes of chemical compounds derived from carbonic acid or carbon dioxide.", "https://en.wikipedia.org/wiki/Carbonate"], ["carotenoid", "The organic pigments that are produced by algae and plants, as well as severalbacteriaandfungi.", "https://en.wikipedia.org/wiki/Carotenoid"], ["catalase", "It is a common enzyme located in nearly all livingorganismsexposed tooxygen, such as bacteria, plants, and animals.", "https://en.wikipedia.org/wiki/Catalase"], ["cell", "The structural and functional unit of all livingorganisms; an autonomous self-replicating unit that may exist as a functional independent unit oflife(as in the case ofunicellular organisms), or as a sub-unit alongside other cells, each of which is specialized for carrying out particular functions towards the cause of the organism as a whole (as inmulticellular organisms).", "https://en.wikipedia.org/wiki/Cell_(biology)"], ["cell biology", "Explains cell structure, organization of the organelles they contain, their physiological properties, metabolic processes, signaling pathways, life cycle, and interactions with their environment. This is done both on a microscopic and molecular level as it encompasses prokaryotic cells and eukaryotic cells.", "https://en.wikipedia.org/wiki/Cell_biology"], ["cell membrane", "The semipermeable membrane surrounding the cytoplasm of a cell.", "https://en.wikipedia.org/wiki/Cell_membrane"], ["cell nucleus", "The \"control room\" for the cell. The nucleus gives out all the orders.", "https://en.wikipedia.org/wiki/Cell_nucleus"], ["cell plate", "Grown in the cell's center, it fuses with the parental plasma membrane, creating a new cell wall that enables cell division.", "https://en.wikipedia.org/wiki/Cell_plate"], ["cell theory", "The theory that all living things are made up of cells.", "https://en.wikipedia.org/wiki/Cell_theory"], ["centriole", "A cylindrical cell structure[1] composed mainly of a protein called tubulin that is found in most eukaryotic cells.", "https://en.wikipedia.org/wiki/Centriole"], ["centroid", "The intersection of the three medians of a triangle (each median connecting a vertex with the midpoint of the opposite side). It lies on the triangle's Euler line, which also goes through various other key points including the orthocenter and the circumcenter.", "https://en.wikipedia.org/wiki/Centroid"], ["centrosome", "An organelle that is the main place where cell microtubules get organized, occurring only in plant and animal cells and regulating the cell division cycle.", "https://en.wikipedia.org/wiki/Centrosome"], ["chemical bond", "A lasting attraction between atoms that enables the formation of chemical compounds. The bond may result from the electrostatic force of attraction between atoms with opposite charges, or through the sharing of electrons as in the covalent bonds.", "https://en.wikipedia.org/wiki/Chemical_bond"], ["chemical compound", "A chemical substance consisting of two or more different chemically bonded chemical elements, with a fixed ratio determining the composition. The ratio of each element is usually expressed by chemical formula.", "https://en.wikipedia.org/wiki/Chemical_compound"], ["chemical equilibrium", "The state in which both reactants and products are present in concentrations which have no further tendency to change with time in a chemical reaction.", "https://en.wikipedia.org/wiki/Chemical_equilibrium"], ["chemical kinetics", "The study and discussion of chemical reactions with respect to reaction rates, effect of various variables, re-arrangement of atoms, formation of intermediates, etc.", "https://en.wikipedia.org/wiki/Chemical_kinetics"], ["chemical reaction", "A process that leads to the transformation of one set of chemical substances to another.", "https://en.wikipedia.org/wiki/Chemical_reaction"], ["chemistry", "A branch of physical science that studies the composition, structure, properties and change of matter.", "https://en.wikipedia.org/wiki/Chemistry"], ["chloride", "A compound of chlorine with another element or group, especially a salt of the anion Cl− or an organic compound with chlorine bonded to an alkyl group.", "https://en.wikipedia.org/wiki/Chloride"], ["chlorophyll", "Refers to several green pigments found incyanobacteriaand thechloroplastsfound inalgaeandplants.", "https://en.wikipedia.org/wiki/Chlorophyll"], ["chloroplast", "Organelles, specialized subunits, in plant and algal cells, main role of which is to conduct photosynthesis, where the photosynthetic pigment chlorophyll captures the energy from sunlight and converts and stores it in the energy-storage molecules ATP and NADPH while freeing oxygen from water.", "https://en.wikipedia.org/wiki/Chloroplast"], ["cholesterol", "An organic molecule, a sterol, a type of lipid molecule, and biosynthesized by all animal cells because it is an essential structural component of all animal cell membranes—essential to maintain both membrane structural integrity and fluidity.", "https://en.wikipedia.org/wiki/Cholesterol"], ["chromate", "Any salt or ester of chromic acid.", "https://en.wikipedia.org/wiki/Chromate"], ["chromosome", "A threadlike strand ofDNAin thecell nucleusthat carries thegenesin a linear order.", "https://en.wikipedia.org/wiki/Chromosome"], ["clonal selection", ".", "https://en.wikipedia.org/wiki/Clonal_selection"], ["cloning", "The process of producing similar populations of genetically identical individuals that occurs in nature when organisms such as bacteria, insects or plants reproduce asexually.", "https://en.wikipedia.org/wiki/Cloning"], ["complementary DNA", "It isDNAsynthesized from a single strandedRNAtemplate in a reaction catalyzed by the enzymereverse transcriptase. cDNA is often used to cloneeukaryoticgenes inprokaryotes.", "https://en.wikipedia.org/wiki/Complementary_DNA"], ["conservation biology", "The scientific study of nature and of Earth's biodiversity with the aim of protecting species, their habitats, and ecosystems from excessive rates of extinction and the erosion of biotic interactions.", "https://en.wikipedia.org/wiki/Conservation_biology"], ["convergent evolution", "It is the independent development of similar characteristics inspeciesof different lineages.", "https://en.wikipedia.org/wiki/Convergent_evolution"], ["countercurrent exchange", "It is a mechanism that happens innatureand mimicked in industry and engineering, in which there is a crossover of some property, usually heat or some component, between two flowing bodies flowing in opposite directions to each other.", "https://en.wikipedia.org/wiki/Countercurrent_exchange"], ["crista", "It is a fold in the innermembraneof amitochondrion.", "https://en.wikipedia.org/wiki/Crista"], ["cryobiology", "The branch of biology that studies the effects of low temperatures on living things within Earth's cryosphere or in science.", "https://en.wikipedia.org/wiki/Cryobiology"], ["cyclin-dependent kinase", "A family of protein kinases which regulate the cell cycle, transcription, mRNA processing, and the differentiation of nerve cells.", "https://en.wikipedia.org/wiki/Cyclin-dependent_kinase"], ["cytochrome", "It refers to heme-containingproteins. There are three different varieties recognized, cytochromes a, cytochromes b, and cytochromes c.", "https://en.wikipedia.org/wiki/Cytochrome"], ["cytokinin", "A class of plant growth substances (phytohormones) that promotecell division, orcytokinesis, in plant roots and shoots .", "https://en.wikipedia.org/wiki/Cytokinin"], ["cytosine", "One of the four main nucleotide bases found in DNA and RNA, along with adenine, guanine, thymine, and uracil (in RNA); it is a pyrimidine derivative, with a heterocyclic aromatic ring and two substituents attached (an amine group at position 4 and a keto group at position 2).", "https://en.wikipedia.org/wiki/Cytosine"], ["cytoskeleton", ".", "https://en.wikipedia.org/wiki/Cytoskeleton"], ["dalton", "A unit of mass (also known as an atomic mass unit,amu), equal to the mass of a hydrogen atom (1.67 x 1024 g); when measured in grams, it is equal to the reciprocal ofAvogadro's number.", "https://en.wikipedia.org/wiki/Dalton_(unit)"], ["Darwinian fitness", "The genetic contribution of an individual to the next generation's gene pool relative to the average for the population, usually measured by the number of offspring or close kin that survive to reproductive age.", "https://en.wikipedia.org/wiki/Darwinian_fitness"], ["deciduous", "Deciduous means \"falling off at maturity\" or \"tending to fall off\", and it is typically used in order to refer to trees or shrubs that lose their leaves seasonally (most commonly during autumn) and to the shedding of other plant structures such as petals after flowering or fruit when ripe.", "https://en.wikipedia.org/wiki/Deciduous"], ["dehydration reaction", "A chemical reaction that involves the loss of awater moleculefrom the reacting molecule.", "https://en.wikipedia.org/wiki/Dehydration_reaction"], ["denaturation", "A process in which proteins or nucleic acids lose the quaternary, tertiary and secondary structure which is present in their native state, by application of some external stress or compound such as a strong acid or base, a concentrated inorganic salt, or an organic solvent.", "https://en.wikipedia.org/wiki/Denaturation_(biochemistry)"], ["dendrite", "A short branched extension of a nerve cell, along which impulses received from other cells at synapses are transmitted to the cell body.", "https://en.wikipedia.org/wiki/Dendrite"], ["denitrification", "A microbially facilitated process of nitrate reduction (performed by a large group of heterotrophic facultative anaerobic bacteria) that may ultimately produce molecular nitrogen (N2) through a series of intermediate gaseousnitrogen oxideproducts. Part of thenitrogen cycle.", "https://en.wikipedia.org/wiki/Denitrification"], ["deoxyribonucleic acid", "The four bases found in DNA are adenine (abbreviated A), cytosine (C), guanine (G) and thymine (T); these four bases are individually attached to a sugar-phosphate complex to form a complete nucleotide, as shown foradenosine monophosphate(AMP).", "https://en.wikipedia.org/wiki/Deoxyribonucleic_acid"], ["deoxyribose", "More precisely 2-deoxyribose, a monosaccharide with idealized formula H−(C=O)−(CH2)−(CHOH)3 – H. Its name indicates that it is a deoxy sugar, meaning that it is derived from the sugarriboseby loss of an oxygen atom.", "https://en.wikipedia.org/wiki/Deoxyribose"], ["depolarization", "The process of reversing the charge across a cell membrane (usually a NEURON), so causing an ACTION POTENTIAL. In depolarization, the inside of the membrane, which is normally negatively charged, becomes positive and the outside negative. This is brought about by positive sodium ions rapidly passing into the axon.", "https://en.wikipedia.org/wiki/Depolarization"], ["desmosome", "A desmosome (/ˈdɛzməˌsoʊm/; \"binding body\"), also known as amacula adhaerens(plural:maculae adhaerentes) (Latin for \"adhering spot\"), is a cell structure specialized for cell-to-cell adhesion.", "https://en.wikipedia.org/wiki/Desmosome"], ["DNA", "An abbreviation fordeoxyribonucleic acid; a type ofnucleic acidthat serves as the fundamental hereditary material in humans and almost all other organisms.", "https://en.wikipedia.org/wiki/DNA"], ["DNA replication", "The replication of a DNA molecule; the process of producing two identical copies from one original DNA molecule, in which the double helix is unwound and each strand acts as a template for the next strand; nucleotide bases are matched to synthesize the new partner strands.", "https://en.wikipedia.org/wiki/DNA_replication"], ["DNA sequencing", "The process of determining the precise order ofnucleotideswithin aDNAmolecule.", "https://en.wikipedia.org/wiki/DNA_sequencing"], ["dynein", "A motor protein (also called molecular motor or motor molecule) in cells which converts the chemical energy contained in ATP into the mechanical energy of movement.", "https://en.wikipedia.org/wiki/Dynein"], ["ecdysone", "ecdysone is a steroidal prohormone of the major insect molting hormone 20-hydroxyecdysone, which is secreted from the prothoracic glands. Insect molting hormones are generally called ecdysteroids.", "https://en.wikipedia.org/wiki/Ecdysone"], ["ecological efficiency", "ecological efficiency describes the efficiency with which energy is transferred from one trophic level to the next. It is determined by a combination of efficiencies relating to organismic resource acquisition and assimilation in an ecosystem. Primary production occurs in autotrophic organisms of an ecosystem.", "https://en.wikipedia.org/wiki/Ecological_efficiency"], ["ecological niche", "an ecological niche is the role and position a species has in its environment; how it meets its needs for food and shelter, how it survives, and how it reproduces. A species' niche includes all of its interactions with the biotic and abiotic factors of its environment.", "https://en.wikipedia.org/wiki/Ecological_niche"], ["ecological pyramid", "an ecological pyramid (also trophic pyramid, eltonian pyramid, energy pyramid, or sometimes food pyramid) is a graphical representation designed to show the biomass or bio productivity at each trophic level in a given ecosystem. Biomass is the amount of living or organic matter present in an organism.", "https://en.wikipedia.org/wiki/Ecological_pyramid"], ["ecological succession", "ecological succession is the term used to describe what happens to an ecological community over time. It refers to more or less predictable and orderly set of changes that happen in the composition or structure of ecological community.", "https://en.wikipedia.org/wiki/Ecological_succession"], ["ecology", "The scientific analysis and study of interactions among organisms and their environment. It is an interdisciplinary field that includes biology, geography and Earth science.", "https://en.wikipedia.org/wiki/Ecology"], ["ecophysiology", "Abiologicaldiscipline that studies the adaptation of an organism's physiology to environmental conditions.", "https://en.wikipedia.org/wiki/Ecophysiology"], ["ecosystem", "An interaction of living things and non living things in a physical environment.", "https://en.wikipedia.org/wiki/Ecosystem"], ["ecotype", "In evolutionary ecology, an ecotype, [note 1] sometimes called ecospecies, describes a genetically distinct geographic variety, population or race within a species, which is adapted to specific environmental conditions.", "https://en.wikipedia.org/wiki/Ecotype"], ["ectoderm", "The outermost layer of cells or tissue of an embryo in early development, or the parts derived from this, which include the epidermis, nerve tissue, and nephridia.", "https://en.wikipedia.org/wiki/Ectoderm"], ["ectotherm", "An organism in which internal physiological sources of heat are of relatively small or quite negligible importance in controlling body temperature. Some refer to these organisms as \"cold-blooded\".", "https://en.wikipedia.org/wiki/Ectotherm"], ["effector", ".", "https://en.wikipedia.org/wiki/Effector_(biology)"], ["effector cell", "Plasma cells, also called plasma B cells, plasmocytes, plasmacytes, or effector B cells, are white blood cells that secrete large volumes of antibodies. They are transported by the blood plasma and the lymphatic system.", "https://en.wikipedia.org/wiki/Plasma_cell"], ["efferent", "Conducted or conducting outwards or away from something (for nerves, the central nervous system; for blood vessels, the organ supplied).", "https://en.wikipedia.org/wiki/Efferent_(disambiguation)#Anatomical_structures"], ["egg", "The organic vessel containing thezygotein which an animal embryo develops until it can survive on its own; at which point the animal hatches.", "https://en.wikipedia.org/wiki/Egg_(biology)"], ["electric potential", "The amount of work needed to move a unit charge from a reference point to a specific point against an electric field.", "https://en.wikipedia.org/wiki/Electric_potential"], ["electrochemical gradient", "An electrochemical gradient is a gradient of electrochemical potential, usually for an ion that can move across a membrane. The gradient consists of two parts, the electrical potential and a difference in the chemical concentration across a membrane.", "https://en.wikipedia.org/wiki/Electrochemical_gradient"], ["electromagnetic spectrum", "The electromagnetic spectrum is the collective term for all possible frequencies of electromagnetic radiation. The \"electromagnetic spectrum\" of an object has a different meaning, and is instead the characteristic distribution of electromagnetic radiation emitted or absorbed by that particular object.", "https://en.wikipedia.org/wiki/Electromagnetic_spectrum"], ["electron", "The electron is a subatomic particle, symbol e− or β−, with a negative elementary electric charge. Electrons belong to the first generation of the lepton particle family, and are generally thought to be elementary particles because they have no known components or substructure.", "https://en.wikipedia.org/wiki/Electron"], ["electron acceptor", "An electron acceptor is a chemical entity that accepts electrons transferred to it from another compound. It is an oxidizing agent that, by virtue of its accepting electrons, is itself reduced in the process.", "https://en.wikipedia.org/wiki/Electron_acceptor"], ["electron carrier", "electron carrier. Any of various molecules that are capable of accepting one or two electrons from one molecule and donating them to another in the process of electron transport. As the electrons are transferred from one electron carrier to another, their energy level decreases, and energy is released.", "https://en.wikipedia.org/wiki/Electron_carrier"], ["electron donor", "An electron donor is a chemical entity that donates electrons to another compound. It is a reducing agent that, by virtue of its donating electrons, is itself oxidized in the process.", "https://en.wikipedia.org/wiki/Electron_donor"], ["electron microscope", "The electron microscope is a type of microscope that uses a beam of electrons to create an image of the specimen. It is capable of much higher magnifications and has a greater resolving power than a light microscope, allowing it to see much smaller objects in finer detail.", "https://en.wikipedia.org/wiki/Electron_microscope"], ["electron shell", "An electron shell is the outside part of an atom around the atomic nucleus. It is a group of atomic orbitals with the same value of the principal quantum number n.", "https://en.wikipedia.org/wiki/Electron_shell"], ["electron transport chain", "The site in a mitochondrion ofoxidative phosphorylationin eukaryotes. The NADH and succinate generated by thecitric acid cycleare oxidized, providing energy to power ATP synthase. Photosynthetic electron transport chain of the thylakoid membrane.", "https://en.wikipedia.org/wiki/Electron_transport_chain"], ["electronegativity", "A measure of the tendency of an atom to attract a bonding pair of electrons. The Pauling scale is the most commonly used. Fluorine (the most electronegative element) is assigned a value of 4.0, and values range down to caesium and francium which are the least electronegative at 0.7.", "https://en.wikipedia.org/wiki/Electronegativity"], ["element", "A chemical element or element is a species of atoms having the same number of protons in their atomic nuclei (i.e. the same atomic number, Z). There are 118 elements that have been identified, of which the first 94 occur naturally on Earth with the remaining 24 being synthetic elements.", "https://en.wikipedia.org/wiki/Chemical_element"], ["embryo", "A developing stage of amulticellular organism.", "https://en.wikipedia.org/wiki/Embryo"], ["embryo sac", "The female gametophyte of a seed plant, within which the embryo develops. ... (in flowering plants) a large cell of the rudimentary seed, within which the embryo develops. ... An oval structure within an ovule of a flowering plant that contains the egg cell.", "https://en.wikipedia.org/wiki/Embryo_sac"], ["embryology", "s the branch of biology that studies the development of gametes (sex cells), fertilization, and development of embryos and fetuses. Additionally, embryology is the study of congenital disorders that occur before birth.", "https://en.wikipedia.org/wiki/Embryology"], ["enantiomer", "Enantiomers are stereoisomers that are non-superimposable mirror images. A molecule with 1 chiral carbon atom exists as 2 stereoisomers termed enantiomers (see the example below). Enantiomers differ in their configuration (R or S) at the stereogenic center.", "https://en.wikipedia.org/wiki/Enantiomer"], ["endangered species", "Endangered species are threatened by factors such as habitat loss, hunting, disease and climate change, and usually, endangered species, have a declining population or a very limited range.", "https://en.wikipedia.org/wiki/Endangered_species"], ["endemism", "the ecological state of a species being unique to a defined geographic location, such as an island, nation, country, habitat type or other defined zone; organisms are said to beendemicto a place if they are indigenous to it and found nowhere else.", "https://en.wikipedia.org/wiki/Endemism"], ["endergonic reaction", "In chemical thermodynamics, an endergonic reaction (also called a nonspontaneous reaction or an unfavorable reaction) is a chemical reaction in which the standard change in free energy is positive, and energy is absorbed.", "https://en.wikipedia.org/wiki/Endergonic_reaction"], ["endocrine gland", "Endocrine glands are glands of the endocrine system that secrete their products, hormones, directly into the blood rather than through a duct. The major glands of the endocrine system include the pineal gland, pituitary gland, pancreas, ovaries, testes, thyroid gland, parathyroid gland, hypothalamus and adrenal glands.", "https://en.wikipedia.org/wiki/Endocrine_gland"], ["endocrine system", "The endocrine system is the collection of glands that produce hormones that regulate metabolism, growth and development, tissue function, sexual function, reproduction, sleep, and mood, among other things.", "https://en.wikipedia.org/wiki/Endocrine_system"], ["endocytosis", "a form of active transport in which a cell transports molecules (such as proteins) into the cell (endo- + cytosis) by engulfing them in an energy-consuming process.", "https://en.wikipedia.org/wiki/Endocytosis"], ["endoderm", "one of the three primary germ layers in the very early human embryo. The other two layers are the ectoderm (outside layer) and mesoderm (middle layer), with the endoderm being the innermost layer.", "https://en.wikipedia.org/wiki/Endoderm"], ["endodermis", "The organic vessel containing thezygotein which an animalembryodevelops until it can survive on its own; at which point the animal hatches.", "https://en.wikipedia.org/wiki/Endodermis"], ["endoplasmic reticulum", "A type oforganellefound ineukaryotic cellsthat forms an interconnected network of flattened, membrane-enclosed sacs or tube-like structures known as cisternae.", "https://en.wikipedia.org/wiki/Endoplasmic_reticulum"], ["endosperm", "The tissue produced inside theseedsof most of the flowering plants followingfertilization.", "https://en.wikipedia.org/wiki/Endosperm"], ["endosymbiotic theory", "An evolutionary theory of the origin ofeukaryotic cellsfromprokaryoticorganisms, first articulated in 1905 and 1910 by the Russian botanistKonstantin Mereschkowski, and advanced and substantiated with microbiological evidence byLynn Margulisin 1967.", "https://en.wikipedia.org/wiki/Endosymbiotic_theory"], ["endotherm", "An organism that maintains its body at ametabolicallyfavorable temperature, largely by the use of heat set free by its internal bodily functions instead of relying almost purely on ambient heat.", "https://en.wikipedia.org/wiki/Endotherm"], ["entomology", "Entomology is the study of insects, but etymology is the study of words.", "https://en.wikipedia.org/wiki/Entomology"], ["environmental biology", "the branch of biology concerned with the relations between organisms and their environment. bionomics, ecology. biological science, biology - the science that studies living organisms. palaeoecology, paleoecology - the branch of ecology that studies ancient ecology.", "https://en.wikipedia.org/wiki/Environmental_biology"], ["enzyme", "Enzymes are biological molecules (proteins) that act as catalysts and help complex reactions occur everywhere in life. Let's say you ate a piece of meat. Proteases would go to work and help break down the peptide bonds between the amino acids.", "https://en.wikipedia.org/wiki/Enzyme"], ["epicotyl", "It is important for the beginning stages of a plant's life.", "https://en.wikipedia.org/wiki/Epicotyl"], ["epidemiology", "Epidemiology is the study and analysis of the patterns, causes, and effects of health and disease conditions in defined populations. It is the cornerstone of public health, and shapes policy decisions and evidence-based practice by identifying risk factors for disease and targets for preventive healthcare.", "https://en.wikipedia.org/wiki/Epidemiology"], ["epigenetics", "A subfield of genetics that studies cellular and physiological phenotypic trait variations that are caused by external or environmental factors which switch genes on and off and affect how cells read genes, as opposed to those caused by changes in the DNA sequence.", "https://en.wikipedia.org/wiki/Epigenetics"], ["epinephrine", "Ahormone,neurotransmitter, andmedication.", "https://en.wikipedia.org/wiki/Epinephrine"], ["epiphyte", "An organism that grows on the surface of aplantand derives itsmoistureandnutrientsfrom the air, rain, marine environments or from debris accumulating around it.", "https://en.wikipedia.org/wiki/Epiphyte"], ["epistasis", "A phenomenon where the effect of one gene is dependent on the presence of one or more modifier genes.", "https://en.wikipedia.org/wiki/Epistasis"], ["estrogen", "The primary female sexhormone.", "https://en.wikipedia.org/wiki/Estrogen"], ["ethology", "Ethology is the scientific and objective study of non-human animal behaviour rather than human behaviour and usually with a focus on behaviour under natural conditions, and viewing behaviour as an evolutionarily adaptive trait.", "https://en.wikipedia.org/wiki/Ethology"], ["eukaryote", "Organisms whose cells have anucleusenclosed withinmembranes, unlikeProkaryotes(Bacteria and other Archaea).", "https://en.wikipedia.org/wiki/Eukaryote"], ["evolution", "the change in genetic composition of a population over successive generations, which may be caused bynatural selection,inbreeding,hybridization, ormutation.", "https://en.wikipedia.org/wiki/Evolution"], ["evolutionary biology", "Evolutionary biology is the subfield of biology that studies the evolutionary processes that produced the diversity of life on Earth starting from a single origin of life. These processes include the descent of species, and the origin of new species.", "https://en.wikipedia.org/wiki/Evolutionary_biology"], ["exocytosis", "A form of active transport and bulk transport in which a cell transportsmoleculesout of the cell by expelling them through an energy-dependent process.", "https://en.wikipedia.org/wiki/Exocytosis"], ["exon", "Any part of agenethat will encode a part of the final matureRNAproduced by that gene after introns have been removed by RNA splicing.", "https://en.wikipedia.org/wiki/Exon"], ["exponential growth", "It is exhibited when the rate of change of the value of a mathematical function is proportional to the function's current value, resulting in its value at any time being an exponential function of time.", "https://en.wikipedia.org/wiki/Exponential_growth"], ["expressivity", "It quantifies variation in anon-binaryphenotype across individuals carrying a particulargenotype.", "https://en.wikipedia.org/wiki/Expressivity_(genetics)"], ["external fertilization", "spermunits witheggin the open, rather than inside the body of the parents.", "https://en.wikipedia.org/wiki/External_fertilization"], ["extranuclear inheritance", "A transmission ofgenesthat take place outside thenucleus.", "https://en.wikipedia.org/wiki/Extranuclear_inheritance"], ["Facultative anaerobe", "An organism which is capable of producingenergythroughaerobic respirationand then switching toanaerobic respirationdepending on the amounts of oxygen and fermentable material in the environment.", "https://en.wikipedia.org/wiki/Facultative_anaerobic_organism"], ["fermentation", "A metabolic process that consumessugarin the absence ofoxygen.", "https://en.wikipedia.org/wiki/Fermentation"], ["fitness landscape", "These are used to visualize the connection betweengenotypesand reproductive success.", "https://en.wikipedia.org/wiki/Fitness_landscape"], ["foetus", "Ahuman embryoafter eight weeks of development.", "https://en.wikipedia.org/wiki/Foetus"], ["FIRST", "An acronym meaningForInspiration andRecognition ofScience andTechnology; an organization founded by inventor Dean Kamen in 1989 in order to develop ways to inspire students in engineering and technology fields.", "https://en.wikipedia.org/wiki/FIRST"], ["flagellum", "A lash-like appendage that protrudes from thecellbody of certain bacterial andeukaryoticcells.", "https://en.wikipedia.org/wiki/Flagellum"], ["flavin adenine dinucleotide", "Aredox cofactor, more specifically a prosthetic group of a protein, involved in different importantenzymaticreactions inmetabolism.", "https://en.wikipedia.org/wiki/Flavin_adenine_dinucleotide"], ["food chain", "The chain of eating and getting nutrition which starts from a small herbivores animal and ends up at a big carnivorous organism.", "https://en.wikipedia.org/wiki/Food_chain"], ["founder effect", "A loss of genetic variation that takes places when a newpopulationis established by a very small number of individuals from a larger population.", "https://en.wikipedia.org/wiki/Founder_effect"], ["G protein", "A family ofproteinsthat act as molecular switches insidecells, and are implicated in transmitting signals from a diversity of stimuli outside a cell to its interior.", "https://en.wikipedia.org/wiki/G_protein"], ["ganglion", "A cluster (functional group) of nerve cell bodies in a centralized nervous system.", "https://en.wikipedia.org/wiki/Ganglion"], ["gene", "A gene is a locus (or region) of DNA that encodes a functional RNA or protein product, and is the molecular unit of heredity. The transmission of genes to an organism's offspring is the basis of the inheritance of phenotypic traits.", "https://en.wikipedia.org/wiki/Gene"], ["gene pool", "A set of allgenes, or genetic information, in any population, usually of a particularspecies.", "https://en.wikipedia.org/wiki/Gene_pool"], ["genetic code", "A set of rules used by livingcellsto translate information encoded withingenetic material(DNA or mRNA sequences) into proteins.", "https://en.wikipedia.org/wiki/Genetic_code"], ["genetic drift", "An alteration in the frequency of an existinggenevariant in a population due to random sampling oforganisms.", "https://en.wikipedia.org/wiki/Genetic_drift"], ["genetics", "The study of heredity.", "https://en.wikipedia.org/wiki/Genetics"], ["genetic variation", "variations ofgenomesbetween members of species, or between groups of species thriving in different parts of the world as a result ofgenetic mutation. Genetic diversity in a population or species is a result of new gene combinations (e.g.crossing over of chromosomes), genetic mutations,genetic drift, etc.", "https://en.wikipedia.org/wiki/Genetic_variation"], ["genome", "A genetic material of anorganism.", "https://en.wikipedia.org/wiki/Genome"], ["genotype", "Part of the genetic makeup of acell, and therefore of an organism or individual, which determines one of its characteristics (phenotype).", "https://en.wikipedia.org/wiki/Genotype"], ["gizzard", "An organ found in thedigestive tractof some animals, includingarchosaurs(pterosaurs, crocodiles, alligators, and dinosaurs, including birds), earthworms, somegastropods, somefish, and somecrustaceans.", "https://en.wikipedia.org/wiki/Gizzard"], ["guanine", "One of the four mainnucleobasesfound in the nucleic acidsDNAandRNA, the others beingadenine,cytosine, andthymine(uracil in RNA).", "https://en.wikipedia.org/wiki/Guanine"], ["gular", "Of or pertaining to thethroat.", "https://en.wikipedia.org/wiki/Gular_(disambiguation)"], ["habitat", "A place for animals, people and plants and non living things.", "https://en.wikipedia.org/wiki/Habitat"], ["habituation", "A form of learning in which anorganismdecreases or desists its responses to a stimulus after repeated or prolonged presentations .", "https://en.wikipedia.org/wiki/Habituation"], ["hadron", "Any particle that is made from quarks, anti-quarks and gluons. (If you want to learn more about quarks and gluons.", "https://en.wikipedia.org/wiki/Hadron"], ["haloarchaea", "A type of theEuryarchaeota, found in water saturated or nearly saturated withsalt.", "https://en.wikipedia.org/wiki/Haloarchaea"], ["hermaphrodite", "A sexually reproducing organism with both male and femalereproductive organs.", "https://en.wikipedia.org/wiki/Hermaphrodite"], ["herpetology", "The branch of zoology concerned with reptiles and amphibians.", "https://en.wikipedia.org/wiki/Herpetology"], ["heterosis", "The improved or increased function of any biological quality in a hybrid offspring.", "https://en.wikipedia.org/wiki/Heterosis"], ["histology", "The study of the microscopic anatomy of cells and tissues of plants and animals.", "https://en.wikipedia.org/wiki/Histology"], ["hormone", "Any member of a class of signalingmoleculesproduced byglandsinmulticellularorganisms that are transported by the circulatory system to target distant organs to regulate physiology and behaviour.", "https://en.wikipedia.org/wiki/Hormone"], ["human nutrition", "The deal with the provision of essentialnutrientsin food that are necessary to support human life and health.", "https://en.wikipedia.org/wiki/Human_nutrition"], ["hydrocarbon", "An organic compound consisting entirely of hydrogen and carbon atoms. Hydrocarbons from which one hydrogen atom has been removed are functional groups called hydrocarbyls.", "https://en.wikipedia.org/wiki/Hydrocarbon"], ["ichthyology", "The branch of biology devoted to the study offish, including bony fishes (Osteichthyes), cartilaginous fish (Chondrichthyes), and jawless fish (Agnatha).", "https://en.wikipedia.org/wiki/Ichthyology"], ["immune response", "The immune response is how your body recognizes and defends itself against bacteria, viruses, and substances that appear foreign and harmful.", "https://en.wikipedia.org/wiki/Immune_response"], ["immunogloblin", "Glycoprotein molecules produced by plasma cells (white blood cells) which act as a critical part of the immune response by specifically recognizing and binding to particularantigens, such as bacteria or viruses, and aiding in their destruction. Also known asantibodies.", "https://en.wikipedia.org/wiki/Immunogloblin"], ["incomplete dominance", "A form of intermediate inheritance in which one allele for a specific trait is not completely expressed over its paired allele. This results in a third phenotype in which the expressed physical trait is a combination of the phenotypes of both alleles.", "https://en.wikipedia.org/wiki/Incomplete_dominance"], ["insulin", "Insulin helps keeps your blood sugar level from getting too high (hyperglycemia) or too low (hypoglycemia). ... After you eat food and your blood sugar level rises, cells in your pancreas (known as beta cells) are signaled to release insulin into your bloodstream.", "https://en.wikipedia.org/wiki/Insulin"], ["interferon", "A group of signaling proteins made and released by host cells in response to the presence of several pathogens, such as viruses, bacteria, parasites, and also tumor cells. In a typical scenario, a virus-infected cell will release interferons causing nearby cells to heighten their antiviral defenses.", "https://en.wikipedia.org/wiki/Interferon"], ["integrative biology", "A label frequently used to describe various forms of cross-disciplinary and multitaxon research. The term is ill-defined, but in fact it does rely on principles that are transforming 21st-century science.", "https://en.wikipedia.org/wiki/Integrative_biology"], ["interleukin", "A group of cytokines (secreted proteins and signal molecules) that were first seen to be expressed by white blood cells (leukocytes).", "https://en.wikipedia.org/wiki/Interleukin"], ["internal fertilization", "Fertilization that takes place inside theegg-producing individual.", "https://en.wikipedia.org/wiki/Internal_fertilization"], ["International System of Units", "(French:Système international d'unités; abbreviated SI) The modern form of the metric system, and the most widely used system of measurement.", "https://en.wikipedia.org/wiki/International_System_of_Units"], ["invertebrate", "A group of animals that have no backbone, unlike animals such as reptiles, amphibians, fish, birds and mammals, which all have a backbone.", "https://en.wikipedia.org/wiki/Invertebrate"], ["ion", "An atom or molecule with a net electric charge due to the loss or gain of one or more electrons.", "https://en.wikipedia.org/wiki/Ion"], ["ionic bond", "The complete transfer of valence electron(s) between atoms. It is a type of chemical bond that generates two oppositely charged ions. In ionic bonds, the metal loses electrons to become a positively charged cation, whereas the nonmetal accepts those electrons to become a negatively charged anion.", "https://en.wikipedia.org/wiki/Ionic_bond"], ["isomer", "A molecule with the same chemical formula as another molecule, but with a different chemical structure. That is, isomers contain the same number of atoms of each element, but have different arrangements of their atoms.", "https://en.wikipedia.org/wiki/Isomer"], ["isotonic solution", "Refers to two solutions having the same osmotic pressure across a semipermeable membrane. This state allows for the free movement of water across the membrane without changing the concentration of solutes on either side.", "https://en.wikipedia.org/wiki/Isotonic_solutions"], ["isotope", "Each atomic number identifies a specific element, but not the isotope; an atom of a given element may have a wide range in its number of neutrons. The number of nucleons (both protons and neutrons) in the nucleus is the atom's mass number, and each isotope of a given element has a different mass number.", "https://en.wikipedia.org/wiki/Isotope"], ["jejunum", "The midsection of the small intestine of many higher vertebrates like mammals, birds, and reptiles. It is present between theduodenumand theileum.", "https://en.wikipedia.org/wiki/Jejunum"], ["kinase", "Anenzymethat catalyzes the transfer of phosphate groups from high-energy, phosphate-donating molecules to specific substrates .", "https://en.wikipedia.org/wiki/Kinase"], ["Krebs cycle", "Also known as thecitric acid cycleor thetricarboxylic acid (TCA) cycleis a series of chemical reactions used by all aerobic organisms to generate energy through the oxidation of acetyl-CoA derived from carbohydrates, fats and proteins into carbon dioxide and chemical energy in the form of guanosine triphosphate (GTP). In addition, the cycle provides precursors of certain amino acids as well as the reducing agent NADH that is used in numerous other biochemical reactions. Its central importance to many biochemical pathways suggests that it was one of the earliest established components of cellular metabolism and may have originated abiogenically.", "https://en.wikipedia.org/wiki/Krebs_cycle"], ["lacteal", "A lymphatic capillary that absorbs dietary fats in the villi of the small intestine.", "https://en.wikipedia.org/wiki/Lacteal"], ["lagging strand", "On the lagging strand template, a primase \"reads\" the template DNA and initiates synthesis of a short complementary RNA primer. A DNA polymerase extends the primed segments, forming Okazaki fragments. The RNA primers are then removed and replaced with DNA, and the fragments of DNA are joined together by DNA ligase.", "https://en.wikipedia.org/wiki/Lagging_strand"], ["larva", "A larva (plural larvae /ˈlɑːrviː/) is a distinct juvenile form many animals undergo before metamorphosis into adults. Animals with indirect development such as insects, amphibians, or cnidarians typically have a larval phase of their life cycle.", "https://en.wikipedia.org/wiki/Larva"], ["law of independent assortment", "law of independent assortment. the principle, originated by Gregor Mendel, stating that when two or more characteristics are inherited, individual hereditary factors assort independently during gamete production, giving different traits an equal opportunity of occurring together.", "https://en.wikipedia.org/wiki/Law_of_independent_assortment"], ["lepton", "A lepton is an elementary, half-integer spin (spin 1⁄2) particle that does not undergo strong interactions. Two main classes of leptons exist: charged leptons (also known as the electron-like leptons), and neutral leptons (better known as neutrinos).", "https://en.wikipedia.org/wiki/Lepton"], ["leukocyte", "A colourless cell which circulates in the blood and body fluids and is involved in counteracting foreign substances and disease; sometimes called awhite blood cell. There are several types, all amoeboid cells with a nucleus, including lymphocytes, granulocytes, and monocytes.", "https://en.wikipedia.org/wiki/Leukocyte"], ["ligament", "The fibrous connective tissue that connects bones to other bones and is also known asarticular ligament,articular larua,fibrous ligament, ortrue ligament.", "https://en.wikipedia.org/wiki/Ligament"], ["light-independent reactions", "Chemical reactions that convertcarbon dioxideand other compounds intoglucose.", "https://en.wikipedia.org/wiki/Light-independent_reactions"], ["linked genes", "when two genes are close together on the same chromosome, they do not assort independently and are said to be linked.", "https://en.wikipedia.org/wiki/Linked_genes"], ["lipid", "a substance that is insoluble in water and soluble in alcohol, ether, and chloroform. Lipids are an important component of living cells. Together with carbohydrates and proteins, lipids are the main constituents of plant and animal cells. Cholesterol and triglycerides are lipids.", "https://en.wikipedia.org/wiki/Lipid"], ["lipoprotein", "a biochemical assembly that contains both proteins and lipids, bound to the proteins, which allow fats to move through the water inside and outside cells. The proteins serve to emulsify the lipid molecules.", "https://en.wikipedia.org/wiki/Lipoprotein"], ["M phase", "Mitosis and cytokinesis together define the mitotic (M) phase of an animal cell cycle – the division of the mother cell into two daughter cells, genetically identical to each other and to their parent cell.", "https://en.wikipedia.org/wiki/M_phase"], ["macroevolution", "Evolution on a scale of separated gene pools. Macroevolutionary studies focus on change that occurs at or above the level of species, in contrast with microevolution, which refers to smaller evolutionary changes (typically described as changes in allele frequencies) within a species or population.", "https://en.wikipedia.org/wiki/Macroevolution"], ["macromolecule", "A very large molecule, such as a protein, commonly created by polymerization of smaller subunits (monomers). They are typically composed of thousands or more atoms.", "https://en.wikipedia.org/wiki/Macromolecule"], ["macronutrient", "Nutrients needed in large amounts which provide calories or energy. Nutrients are substances needed for growth, metabolism, and for other body functions. There are three basic types of macronutrients: fats, proteins, and carbohydrates.", "https://en.wikipedia.org/wiki/Macronutrient"], ["macrophage", "A kind of swallowing cell, which means it functions by literally swallowing up other particles or smaller cells. Macrophages engulf and digest debris (like dead cells) and foreign particles through the process ofphagocytosis, so macrophages act like scavengers.", "https://en.wikipedia.org/wiki/Macrophage"], ["mammalogy", "The study of mammals, a class of vertebrates with characteristics such as homeothermic metabolism, fur, four-chambered hearts, and complex nervous systems.", "https://en.wikipedia.org/wiki/Mammalogy"], ["marine biology", "The study of organisms in the ocean or other marine bodies of water. Given that in biology many phyla, families and genera have some species that live in the sea and others that live on land, marine biology classifies species based on the environment rather than on taxonomy.", "https://en.wikipedia.org/wiki/Marine_biology"], ["mass balance", "A mass balance, also called a material balance, is an application of conservation of mass to the analysis of physical systems. By accounting for material entering and leaving a system, mass flows can Be identified which might have been unknown, or difficult to measure without this technique.", "https://en.wikipedia.org/wiki/Mass_balance"], ["mass number", "The mass number (A), also called atomic mass number or nucleon number, is the total number of protons and neutrons (together known as nucleons) in an atomic nucleus.", "https://en.wikipedia.org/wiki/Mass_number"], ["mast cell", "A cell filled with basophil granules, found in numbers in connective tissue and releasing histamine and other substances during inflammatory and allergic reactions.", "https://en.wikipedia.org/wiki/Mast_cell"], ["medulla", "The continuation of the spinal cord within the skull, forming the lowest part of the brainstem and containing control centres for the heart and lungs.", "https://en.wikipedia.org/wiki/Medulla_oblongata"], ["meiosis", "A special type of cell division in which a dividing parent cell proceeds through two consecutive divisions, ultimately producing four gamete daughter cells in each of which the chromosome number is half of that in the original parent cell. This process is exclusive to sexual reproduction, and is required to produce egg and sperm cells.", "https://en.wikipedia.org/wiki/Meiosis"], ["membrane potential", "When a nerve or muscle cell is at \"rest\", its membrane potential is called the resting membrane potential. In a typical neuron, this is about –70 millivolts (mV). The minus sign indicates that the inside of the cell is negative with respect to the surrounding extracellular fluid.", "https://en.wikipedia.org/wiki/Membrane_potential"], ["meson", "Hadronic subatomic particles composed of one quark and one antiquark, bound together by the strong interaction.", "https://en.wikipedia.org/wiki/Meson"], ["messenger RNA", "A large family of RNA molecules that convey genetic information from DNA to the ribosome.", "https://en.wikipedia.org/wiki/Messenger_RNA"], ["metaphase", "The third phase of mitosis, in which duplicated genetic material carried in the nucleus of a parent cell is separated into two identical daughter cells. During metaphase, the cell's chromosomes align themselves in the middle of the cell through a type of cellular \"tug of war\".", "https://en.wikipedia.org/wiki/Metaphase"], ["microbiology", "The study of microscopic organisms, such as bacteria, viruses, archaea, fungi and protozoa. This discipline includes fundamental research on the biochemistry, physiology, cell biology, ecology, evolution and clinical aspects of microorganisms, including the host response to these agents.", "https://en.wikipedia.org/wiki/Microbiology"], ["microevolution", "The alteration inallelefrequencies that happens over time within a population.", "https://en.wikipedia.org/wiki/Microevolution"], ["microtome", "A tool used to cut extremely thin slices of material, known as sections.", "https://en.wikipedia.org/wiki/Microtome"], ["mitosis", "The process by which a eukaryotic cell nucleus splits in two, followed by division of the parent cell into two daughter cells. The word \"mitosis\" means \"threads\", and it refers to the threadlike appearance of chromosomes as the cell prepares to divide. Comparebinary fissionin prokaryotes.", "https://en.wikipedia.org/wiki/Mitosis"], ["molarity", "A unit of concentration measuring the number of moles of a solute per liter of solution.", "https://en.wikipedia.org/wiki/Molarity"], ["mole", "The SI unit of measurement used to measure the number of things, usually atoms or molecules. One mole of something is equal to Avogadro's number.", "https://en.wikipedia.org/wiki/Mole_(unit)"], ["molecule", "The smallest particle in a chemical element or compound that has the chemical properties of that element or compound. Molecules are made up of atoms that are held together by chemical bonds. These bonds form as a result of the sharing or exchange of electrons among atoms.", "https://en.wikipedia.org/wiki/Molecule"], ["molecular biology", "The branch of biology concerning biological activity at the molecular level. The field of molecular biology overlaps with biology and chemistry and in particular with genetics and biochemistry.", "https://en.wikipedia.org/wiki/Molecular_biology"], ["molecular physics", "Molecular physics is the study of the physical properties of molecules, the chemical bonds between atoms As well As the molecular dynamics. Its most important experimental techniques are the various types of spectroscopy; scattering is also used. The field is closely related to atomic physics and overlaps greatly with theoretical chemistry, physical chemistry and chemical physics.", "https://en.wikipedia.org/wiki/Molecular_physics"], ["molecular switch", "A molecule that can be reversibly changed between two or more stable states.", "https://en.wikipedia.org/wiki/Molecular_switch"], ["monomer", "Amoleculethat \"can undergo polymerization thereby contributing constitutional units to the essential structure of a macromolecule\".", "https://en.wikipedia.org/wiki/Monomer"], ["motor neuron", "A neuron whose cell body is situated in the motorcortex,brainstemor thespinal cord, and whose axon (fiber) projects to the spinal cord or outside of the spinal cord to directly or indirectly control effector organs, mainly muscles and glands.", "https://en.wikipedia.org/wiki/Motor_neuron"], ["mucous membrane", "A membrane that lines various cavities in the body and covers the surface ofinternal organs.", "https://en.wikipedia.org/wiki/Mucous_membrane"], ["multicellular organism", "A organism that consists of more than onecell, in contrast to unicellular organisms.", "https://en.wikipedia.org/wiki/Multicellular_organism"], ["muon", "The muon is an unstable subatomic particle with a mean lifetime of 2.2 µS. Among all known unstable subatomic particles, only the neutron (lasting around 15 minutes) and some atomic nuclei have a longer decay lifetime; others decay significantly faster.", "https://en.wikipedia.org/wiki/Muon"], ["mycology", "The branch of biology concerned with the study offungi, including their genetic and biochemical properties, their taxonomy and their use to humans as a source for tinder, medicine, food, and entheogens, as well as their dangers, such as poisoning or infection.", "https://en.wikipedia.org/wiki/Mycology"], ["myofibril", "A basic rod-like unit of a musclecell.", "https://en.wikipedia.org/wiki/Myofibril"], ["myosin", "A superfamily of motorproteinsbest known for their roles in muscle contraction and in a wide range of other motility processes ineukaryotes.", "https://en.wikipedia.org/wiki/Myosin"], ["natural selection", "A process in nature in which organisms possessing certaingenotypiccharacteristics that make them better adjusted to an environment tend to survive, reproduce, increase in number orfrequency, and therefore, are able to transmit and perpetuate their essential genotypic qualities to succeeding generations.", "https://en.wikipedia.org/wiki/Natural_selection"], ["neurobiologyorneuroscience", "Neurobiology (or Neuroscience) is the scientific study of the nervous system.", "https://en.wikipedia.org/wiki/Neurobiology"], ["neuromuscular junction", "A chemical synapse formed by the contact between a motorneuronand amuscle fiber.", "https://en.wikipedia.org/wiki/Neuromuscular_junction"], ["neuron", "An electrically excitable cell that receives, processes, and transmits information through electrical and chemical signals.", "https://en.wikipedia.org/wiki/Neuron"], ["neurotransmitter", "Theendogenouschemicals that enableneurotransmission.", "https://en.wikipedia.org/wiki/Neurotransmitter"], ["neutrino", "A neutrino (/nuːˈtriːnoʊ/ or /njuːˈtriːnoʊ/) (denoted by the Greek letter ν) is a lepton, an elementary particle with half-integer spin, that interacts only via the weak subatomic force and gravity. The mass of the neutrino is tiny compared to other subatomic particles.", "https://en.wikipedia.org/wiki/Neutrino"], ["nucleic acid", "The biopolymers, or smallbiomolecules, essential to all known forms of life .", "https://en.wikipedia.org/wiki/Nucleic_acid"], ["nucleic acid sequence", "A succession of letters that indicate the order ofnucleotidesforming alleles within aDNAorRNAmolecule.", "https://en.wikipedia.org/wiki/Nucleic_acid_sequence"], ["nucleobase", "The nitrogen-containing biological compounds that formnucleosides, which in turn are components ofnucleotides, with all of these monomers constituting the basic building blocks of nucleic acids.", "https://en.wikipedia.org/wiki/Nucleobase"], ["nucleoid", "An irregularly shaped region within the cell of aprokaryotethat contains all or most of the genetic material, calledgenophore.", "https://en.wikipedia.org/wiki/Nucleoid"], ["nucleolus", "The largest structure in the nucleus ofeukaryotic cells.", "https://en.wikipedia.org/wiki/Nucleolus"], ["nucleotide", "the organic molecules that serve as themonomerunits for forming the nucleic acid polymers deoxyribonucleic acid (DNA) andribonucleic acid(RNA), both of which are essential biomolecules within all life-forms onEarth.", "https://en.wikipedia.org/wiki/Nucleotide"], ["organ", "A collection of tissues joined in a structural unit to serve a common function.", "https://en.wikipedia.org/wiki/Organ_(anatomy)"], ["organism", "A contiguous living system.", "https://en.wikipedia.org/wiki/Organism"], ["ornithology", "The branch of zoology that concerns the study of birds. Etymologically, the word \"ornithology\" derives from the ancient Greek ὄρνιςornis(\"bird\") and λόγοςlogos(\"rationale\" or \"explanation\").", "https://en.wikipedia.org/wiki/Ornithology"], ["osmosis", "The spontaneous net movement of solvent molecules through a semi-permeable membrane into a region of higher solute concentration, in the direction that tends to equalize the solute concentrations on the two sides.", "https://en.wikipedia.org/wiki/Osmosis"], ["paleontology", "The study of the history of life on Earth as reflected in the fossil record. Fossils are the remains or traces of organisms (plants, animals, fungi, bacteria and other single-celled living things) that lived in the geological past and are preserved in the crust of the Earth.", "https://en.wikipedia.org/wiki/Paleontology"], ["parallel evolution", "The development of a similar trait in related, but distinct, species descending from the sameancestor, but from different clades.", "https://en.wikipedia.org/wiki/Parallel_evolution"], ["parasitology", "The study of parasites, their hosts, and the relationship between them. As a biological discipline, the scope of parasitology is not determined by the organism or environment in question, but by their way of life.", "https://en.wikipedia.org/wiki/Parasitology"], ["pathobiology", "The study or practice of pathology with greater emphasis on the biological than on the medical aspects.", "https://en.wikipedia.org/wiki/Pathobiology"], ["pathology", "A medical specialty that is concerned with the diagnosis of disease based on the laboratory analysis of bodily fluids such as blood and urine, as well as tissues, using the tools of chemistry, clinical microbiology, hematology and molecular pathology.", "https://en.wikipedia.org/wiki/Pathology"], ["pH", "A numeric scale used to specify the acidity or basicity (alkalinity) of an aqueous solution. It is roughly the negative of the logarithm to base 10 of the concentration, measured in units of moles per liter, of hydrogen ions.", "https://en.wikipedia.org/wiki/PH"], ["pharmacology", "The science of drug action on biological systems. In its entirety, it embraces knowledge of the sources, chemical properties, biological effects and therapeutic uses of drugs.", "https://en.wikipedia.org/wiki/Pharmacology"], ["phenotype", "The composite of an organism's observable features or traits, such as its morphology, development, biochemical or physiological properties, behavior, and products of behavior.", "https://en.wikipedia.org/wiki/Phenotype"], ["pheromone", "A secreted or excreted chemical factor that triggers a social response in members of the samespecies.", "https://en.wikipedia.org/wiki/Pheromone"], ["phloem", "The conducting tissue in plants responsible for the conduction of food particles.", "https://en.wikipedia.org/wiki/Phloem"], ["physiology", "the branch of biology dealing with the functions and activities of living organisms and their parts, including all physical and chemical processes.", "https://en.wikipedia.org/wiki/Physiology"], ["phytochemistry", "The study ofphytochemicals, which are chemicals derived from plants.", "https://en.wikipedia.org/wiki/Phytochemistry"], ["phytopathology", "The science of diagnosing and managing plant diseases.", "https://en.wikipedia.org/wiki/Phytopathology"], ["placebo", "Asubstanceor treatment of no intended therapeutic value.", "https://en.wikipedia.org/wiki/Placebo"], ["plant nutrition", "The study of the chemical elements and compounds necessary for plant growth, plantmetabolismand their external supply.", "https://en.wikipedia.org/wiki/Plant_nutrition"], ["plasmolysis", "The process in whichcellslose water in ahypertonic solution.", "https://en.wikipedia.org/wiki/Plasmolysis"], ["pollination", "The transfer ofpollenfrom a male part of a plant to a female part of a plant, enabling later fertilisation and the production of seeds, most often by an animal or by wind.", "https://en.wikipedia.org/wiki/Pollination"], ["polygene", "A member of a group of non-epistatic genes that interact additively to influence aphenotypictrait.", "https://en.wikipedia.org/wiki/Polygene"], ["polymer", "A large molecule, ormacromolecule, composed of many repeated subunits.", "https://en.wikipedia.org/wiki/Polymer"], ["polymerase chain reaction", "A technique used inmolecular biologyto amplify a single copy or a few copies of a segment ofDNAacross several orders of magnitude, generating thousands to millions of copies of a particularDNAsequence.", "https://en.wikipedia.org/wiki/Polymerase_chain_reaction"], ["polyploid", "The cells and organisms are those containing more than two paired sets ofchromosomes.", "https://en.wikipedia.org/wiki/Polyploid"], ["population biology", "The study of populations of organisms, especially the regulation of population size, life history traits such as clutch size, and extinction.", "https://en.wikipedia.org/wiki/Population_biology"], ["population ecology", "A subfield of ecology that deals with the dynamics of species populations and how these populations interact with the environment. It is the study of how the population sizes of species change over time and space. Also calledautoecology.", "https://en.wikipedia.org/wiki/Population_ecology"], ["population genetics", "The study of genetic variation within populations, involving the examination and modelling of changes in the frequencies of genes and alleles in populations across space and time.", "https://en.wikipedia.org/wiki/Population_genetics"], ["predation", "A biological interaction where apredatorkills and eats itsprey.", "https://en.wikipedia.org/wiki/Predation"], ["primase", "Anenzymeinvolved in the replication ofDNAand is a type ofRNA polymerase.", "https://en.wikipedia.org/wiki/Primase"], ["primer", "A short strand ofRNAorDNAthat serves as a starting point forDNA synthesis.", "https://en.wikipedia.org/wiki/Primer_(molecular_biology)"], ["progesterone", "An endogenous steroid and progestogen sexhormonewhich is part of themenstrual cycle,pregnancy, andembryogenesisof humans and other species.", "https://en.wikipedia.org/wiki/Progesterone"], ["prokaryote", "An organism which does not have a true nucleus.", "https://en.wikipedia.org/wiki/Prokaryote"], ["protein", "A polypeptide chain of amino acids. It is a body-building nutrient.", "https://en.wikipedia.org/wiki/Protein"], ["protein structure", "A three-dimensional arrangement ofatomsin an amino acid-chain molecule.", "https://en.wikipedia.org/wiki/Protein_structure"], ["Proxemics", "is the study of human use of space and the effects that population density has on behaviour, communication, and social interaction.", "https://en.wikipedia.org/wiki/Proxemics"], ["psychobiology", "The application of the principles of biology to the study of physiological, genetic, and developmental mechanisms of behavior in humans and other animals. Also calledbehavioral neuroscience,biological psychology, andbiopsychology.", "https://en.wikipedia.org/wiki/Psychobiology"], ["quark", "An elementary particle and a fundamental constituent of matter. Quarks combine to form composite particles called hadrons, the most stable of which are protons and neutrons, the components of atomic nuclei.", "https://en.wikipedia.org/wiki/Quark"], ["reproduction", "Giving birth to one of its kind,sexuallyorasexually.", "https://en.wikipedia.org/wiki/Reproduction"], ["ribosome", "A complex molecular machine, found within all livingcells, that serves as the site of biological protein synthesis.", "https://en.wikipedia.org/wiki/Ribosome"], ["RNA", "A polymeric molecule essential in various biological roles in coding, decoding, regulation, and expression of genes.", "https://en.wikipedia.org/wiki/RNA"], ["RNA polymerase", "A member of a family ofenzymesthat are essential to life: they are found in all organisms and manyviruses.", "https://en.wikipedia.org/wiki/RNA_polymerase"], ["RNA primer", "A short strand ofRNAorDNAthat serves as a starting point for DNA synthesis.", "https://en.wikipedia.org/wiki/Primer_(molecular_biology)"], ["Schwann cell", "The principal glia of theperipheral nervous system(PNS).", "https://en.wikipedia.org/wiki/Schwann_cell"], ["sclerenchyma", "It is a type of the cell walls which have thick lignified secondary walls and often die when mature.", "https://en.wikipedia.org/wiki/Ground_tissue#Sclerenchyma"], ["sexual reproduction", "A type ofreproductionin whichcellsfrom two parents unite to form the first cell of a new organism.", "https://en.wikipedia.org/wiki/Sexual_reproduction"], ["SI units", "A system of fundamental physical units (SI units) widely used in the sciences and including the metre, kilogram, second, ampere, kelvin, candela, and mole, together with a set of prefixes to indicate multiplication or division by a power of ten.", "https://en.wikipedia.org/wiki/SI_units"], ["Sociality", "The degree to which individuals in an animal population tend to associate in social groups and form cooperative societies.", "https://en.wikipedia.org/wiki/Sociality"], ["sociobiology", "A field of scientific study that is based on the hypothesis that social behavior has resulted from evolution and attempts to explain and examine social behavior within that context.", "https://en.wikipedia.org/wiki/Sociobiology"], ["soil biology", "The study ofmicrobialand faunal activity and ecology insoil.", "https://en.wikipedia.org/wiki/Soil_biology"], ["soil microbiology", "The study of organisms in soil, their functions, and how they affect soil properties.", "https://en.wikipedia.org/wiki/Soil_microbiology"], ["species", "The basic unit of classification and ataxonomicrank, as well as a unit of biodiversity, but it has proven difficult to find a satisfactory definition.", "https://en.wikipedia.org/wiki/Species"], ["speciation", "The evolutionary process by which populations evolve to become distinctspecies.", "https://en.wikipedia.org/wiki/Speciation"], ["stem cell", "The biological cells that can differentiate into other types of cells and can divide to produce more of the same type of stem cells.", "https://en.wikipedia.org/wiki/Stem_cell"], ["steroid", "A biologically active organic compound with four rings arranged in a specific molecular configuration.", "https://en.wikipedia.org/wiki/Steroid"], ["structural biology", "The branch of molecular biology, biochemistry, and biophysics concerned with the molecular structure of biological macromolecules, especially proteins and nucleic acids, how they acquire the structures they have, and how alterations in their structures affect their function.", "https://en.wikipedia.org/wiki/Structural_biology"], ["symbiogenesis", "is an evolutionary theory of the origin of eukaryotic cells from prokaryotic organisms occurring from symbiosis.", "https://en.wikipedia.org/wiki/Symbiogenesis"], ["Symbiosis", "is any type of a close and long-term biological interaction between two different biological organisms, be it mutualistic, commensalistic, or parasitic.", "https://en.wikipedia.org/wiki/Symbiosis"], ["synthetic biology", "An interdisciplinary branch of biology and engineering. The subject combines various disciplines from within these domains, such as biotechnology, evolutionary biology, molecular biology, systems biology, biophysics, computer engineering, and genetic engineering.", "https://en.wikipedia.org/wiki/Synthetic_biology"], ["systematics", "The scientific study of biodiversity. It is concerned with the discovering and naming of new species of organisms (nomenclature) and arranging these taxa into classification schemes (taxonomy). A large part of modern systematics concerns establishing the evolutionary relationships among various taxa (phylogenetics) using methods of comparative biology (e.g. physiology, behavior, biochemistry, morphology, genetics) and statistical analysis.", "https://en.wikipedia.org/wiki/Systematics"], ["T cell", "A type oflymphocytethat plays a central role in cell-mediatedimmunity.", "https://en.wikipedia.org/wiki/T_cell"], ["taxon", "A group of one or more populations of an organism or organisms seen bytaxonomiststo form a unit.", "https://en.wikipedia.org/wiki/Taxon"], ["testosterone", "The primary male sex hormone and an anabolicsteroid.", "https://en.wikipedia.org/wiki/Testosterone"], ["thymine", "One of the fournucleobasesin the nucleic acid ofDNAthat are represented by the letters G–C–A–T.", "https://en.wikipedia.org/wiki/Thymine"], ["transcription", "Transcription is the first step of gene expression, in which a particular segment of DNA is copied into RNA (mRNA) by the enzyme RNA polymerase. Both RNA and DNA are nucleic acids, which use base pairs of nucleotides as a complementary language.", "https://en.wikipedia.org/wiki/Transcription_(genetics)"], ["transfer RNA", "An adaptor molecule composed ofRNA, typically 76 to 90 nucleotides in length, that serves as the physical link between the mRNA and the amino acid sequence ofproteins.", "https://en.wikipedia.org/wiki/Transfer_RNA"], ["translation", "The process in whichribosomesin the cytoplasm or ER synthesize proteins after the process of transcription ofDNAtoRNAin the cell's nucleus.", "https://en.wikipedia.org/wiki/Translation_(biology)"], ["trophic level", "An organism is the position it occupies in afood chain.", "https://en.wikipedia.org/wiki/Trophic_level"], ["unicellular organism", "An organism which is made up of only one cell.", "https://en.wikipedia.org/wiki/Unicellular_organism"], ["uracil", "One of the four nucleobases in thenucleic acidofRNAthat are represented by the letters A, G, C and U.", "https://en.wikipedia.org/wiki/Uracil"], ["urea", "Anorganiccompound with chemical formula CO(NH2)2.", "https://en.wikipedia.org/wiki/Urea"], ["uric acid", "A heterocyclic compound ofcarbon,nitrogen,oxygen, andhydrogenwith the formula C5H4N4O3.", "https://en.wikipedia.org/wiki/Uric_acid"], ["urine", "A liquid by-product ofmetabolismin humans and in many animals.", "https://en.wikipedia.org/wiki/Urine"], ["uterus", "A major female hormone-responsive secondary sex organ of thereproductive systemin humans and most othermammals.", "https://en.wikipedia.org/wiki/Uterus"], ["vacuole", "A membrane-bound organelle which is present in all plant and fungal cells and some protist, animal and bacterial cells.", "https://en.wikipedia.org/wiki/Vacuole"], ["valence", "In several fields the valence of an element refers to the number of elements to which it can connect: Valence (chemistry), the valence of an atom. Valency (linguistics), the valence of a verb. Degree (graph theory), also called the valency of a vertex in graph theory.", "https://en.wikipedia.org/wiki/Valence_(chemistry)"], ["valence band", "The valence band is the highest range of electron energies in which electrons are normally present at absolute zero temperature, while the conduction band is the lowest range of vacant electronic states.", "https://en.wikipedia.org/wiki/Valence_band"], ["valence bond theory", "Valence bond theory (VB) is a straightforward extension of Lewis structures. Valence bond theory says that electrons in a covalent bond reside in a region that is the overlap of individual atomic orbitals.", "https://en.wikipedia.org/wiki/Valence_bond_theory"], ["valence electron", "A valence electron is an electron that is associated with an atom, and that can participate in the formation of a chemical bond; in a single covalent bond, both atoms in the bond contribute one valence electron in order to form a shared pair.", "https://en.wikipedia.org/wiki/Valence_electron"], ["valence shell", "The electrons in the outermost occupied shell (or shells) determine the chemical properties of the atom; it is called the valence shell. Each shell consists of one or more subshells, and each subshell consists of one or more atomic orbitals.", "https://en.wikipedia.org/wiki/Valence_shell"], ["vasodilation", "The widening of blood vessels.", "https://en.wikipedia.org/wiki/Vasodilation"], ["vegetative reproduction", "The type of reproduction in which sexual process is not involved, also known as asexual reproduction.", "https://en.wikipedia.org/wiki/Vegetative_reproduction"], ["vesicle", "A small structure within acell, orextracellular, consisting of fluid enclosed by a lipidbilayer.", "https://en.wikipedia.org/wiki/Vesicle_(biology_and_chemistry)"], ["vestigiality", "The retention during the process of evolution of genetically determined structures or attributes that have lost some or all of their ancestral function in a givenspecies.", "https://en.wikipedia.org/wiki/Vestigiality"], ["virology", "Virology is the study of viruses – submicroscopic, parasitic particles of genetic material contained in a protein coat and virus-like agents.", "https://en.wikipedia.org/wiki/Virology"], ["virus", "A small infectious agent that replicates only inside the living cells of otherorganisms. .", "https://en.wikipedia.org/wiki/Virus"], ["water potential", "Thepotential energyof water per unit volume relative to pure water in reference conditions.", "https://en.wikipedia.org/wiki/Water_potential"], ["white blood cell", "A component of blood that functions in the immune system. Also known as aleukocyte.", "https://en.wikipedia.org/wiki/White_blood_cell"], ["whole genome sequencing", "The process of determining the completeDNAsequence of an organism's genome at a single time.", "https://en.wikipedia.org/wiki/Whole_genome_sequencing"], ["wobble base pair", "A pairing between two nucleotides inRNAmolecules that does not follow Watson-Crick base pair rules.", "https://en.wikipedia.org/wiki/Wobble_base_pair"], ["wood", "The inner layer of the stems of woody plants, composed ofxylem.", "https://en.wikipedia.org/wiki/Wood"], ["xanthophyll", "The yellow colored photosynthetic pigments.", "https://en.wikipedia.org/wiki/Xanthophyll"], ["xylem", "The plant tissue responsible for the conduction of water from roots to aerial parts of the plant. It forms the woody part of the plant.", "https://en.wikipedia.org/wiki/Xylem"], ["yeast artificial chromosome", "The genetically engineered chromosomes derived from theDNAof the yeast, Saccharomyces cerevisiae, which is then ligated into a bacterial plasmid.", "https://en.wikipedia.org/wiki/Yeast_artificial_chromosome"], ["yolk", "The nutrient-bearing portion of the egg whose primary function is to supply food for the development of theembryo.", "https://en.wikipedia.org/wiki/Yolk"], ["Z lines", ".", "https://en.wikipedia.org/wiki/Myofibril#Formation"], ["zoology", "The branch of biology that studies the animal kingdom, including thestructure,embryology,evolution,classification,habits, and distribution of all animals, both living and extinct, and how they interact with theirecosystems.", "https://en.wikipedia.org/wiki/Zoology"], ["zooplankton", ".", "https://en.wikipedia.org/wiki/Zooplankton"], ["zygospore", "Adiploidreproductive stage in the life cycle of manyfungiandprotists.", "https://en.wikipedia.org/wiki/Zygospore"], ["zygote", "Aeukaryoticcell formed by a fertilization event between twogametes.", "https://en.wikipedia.org/wiki/Zygote"]]